Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/*
 * Component description for Metrology Control Registers
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

#ifndef _METROLOGY_REGS_H_
#define _METROLOGY_REGS_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR METROLOGY REGISTERS                          */
/* ************************************************************************** */

/* -------- STATE_CTRL : (MET_CONTROL Offset: 0x00) (R/W 32) Metrology state control register -------- */
#define STATE_CTRL_STATE_CTRL_Pos                     _UINT32_(0)                               /* (STATE_CTRL) State Control Position */
#define STATE_CTRL_STATE_CTRL_Msk                     (_UINT32_(0xF) << STATE_CTRL_STATE_CTRL_Pos)         /* (STATE_CTRL) State Control Mask */
#define STATE_CTRL_STATE_CTRL(value)                  (STATE_CTRL_STATE_CTRL_Msk & (_UINT32_(value) << STATE_CTRL_STATE_CTRL_Pos))
#define   STATE_CTRL_STATE_CTRL_RESET_Val               _UINT32_(0x0)                           /* (STATE_CTRL) Reset metrology module, reset ATSENSE and halt metrology filters.  */
#define   STATE_CTRL_STATE_CTRL_INIT_Val                _UINT32_(0x1)                           /* (STATE_CTRL) Input control registers are initialized and metrology can initialize itself.  */
#define   STATE_CTRL_STATE_CTRL_RUN_Val                 _UINT32_(0x2)                           /* (STATE_CTRL) Metrology filters are free to run, and outputs are updated at commanded rate.  */

/* -------- FEATURE_CTRL0 : (MET_CONTROL Offset: 0x04) (R/W 32) Metrology feature setting register 0 -------- */
#define FEATURE_CTRL0_RZC_CHAN_SELECT_Pos             _UINT32_(0)                               /* (FEATURE_CTRL0) Raw Zero-Crossing Channel Select Position */
#define FEATURE_CTRL0_RZC_CHAN_SELECT_Msk             (_UINT32_(0xF) << FEATURE_CTRL0_RZC_CHAN_SELECT_Pos)    /* (FEATURE_CTRL0) Raw Zero-Crossing Channel Select Mask */
#define FEATURE_CTRL0_RZC_CHAN_SELECT(value)          (FEATURE_CTRL0_RZC_CHAN_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL0_RZC_CHAN_SELECT_Pos))
#define   FEATURE_CTRL0_RZC_CHAN_SELECT_DISABLED_Val    _UINT32_(0x0)                           /* (FEATURE_CTRL0) Raw Zero-Crossing detection is disabled */
#define   FEATURE_CTRL0_RZC_CHAN_SELECT_V1_Val          _UINT32_(0x1)                           /* (FEATURE_CTRL0) Raw Zero-Crossing detection based on input voltage channel V1 */
#define   FEATURE_CTRL0_RZC_CHAN_SELECT_V2_Val          _UINT32_(0x3)                           /* (FEATURE_CTRL0) Raw Zero-Crossing detection based on input voltage channel V2 */
#define   FEATURE_CTRL0_RZC_CHAN_SELECT_V3_Val          _UINT32_(0x5)                           /* (FEATURE_CTRL0) Raw Zero-Crossing detection based on input voltage channel V3 */
#define FEATURE_CTRL0_RZC_DIR_Pos                     _UINT32_(3)                               /* (FEATURE_CTRL0) Raw Zero-Crossing Direction Selection Position */
#define FEATURE_CTRL0_RZC_DIR_Msk                     (_UINT32_(0x1) << FEATURE_CTRL0_RZC_DIR_Pos)            /* (FEATURE_CTRL0) Raw Zero-Crossing Direction Selection Mask */
#define FEATURE_CTRL0_RZC_DIR(value)                  (FEATURE_CTRL0_RZC_DIR_Msk & (_UINT32_(value) << FEATURE_CTRL0_RZC_DIR_Pos))
#define   FEATURE_CTRL0_RZC_DIR_POSITIVE_Val            _UINT32_(0x0)                           /* (FEATURE_CTRL0) Positive-going raw zero-crossings selected */
#define   FEATURE_CTRL0_RZC_DIR_NEGATIVE_Val            _UINT32_(0x1)                           /* (FEATURE_CTRL0) Negative-going raw zero-crossings selected */
#define FEATURE_CTRL0_SYNCH_Pos                       _UINT32_(4)                               /* (FEATURE_CTRL0) Active Voltage Channel Selection Position */
#define FEATURE_CTRL0_SYNCH_Msk                       (_UINT32_(0x2) << FEATURE_CTRL0_SYNCH_Pos)    /* (FEATURE_CTRL0) Active Voltage Channel Selection Mask */
#define FEATURE_CTRL0_SYNCH(value)                    (FEATURE_CTRL0_SYNCH_Msk & (_UINT32_(value) << FEATURE_CTRL0_SYNCH_Pos))
#define   FEATURE_CTRL0_SYNCH_ACTIVE_PHASE_Val          _UINT32_(0x0)                           /* (FEATURE_CTRL0) Measurement interval based on active phase, determined dynamically */
#define   FEATURE_CTRL0_SYNCH_A_Val                     _UINT32_(0x1)                           /* (FEATURE_CTRL0) Measurement interval based on phase-A */
#define   FEATURE_CTRL0_SYNCH_B_Val                     _UINT32_(0x2)                           /* (FEATURE_CTRL0) Measurement interval based on phase-B */
#define   FEATURE_CTRL0_SYNCH_C_Val                     _UINT32_(0x3)                           /* (FEATURE_CTRL0) Measurement interval based on phase-C */
#define FEATURE_CTRL0_PHASE_A_EN_Pos                 _UINT32_(8)                               /* (FEATURE_CTRL0) Enable Phase A Position */
#define FEATURE_CTRL0_PHASE_A_EN_Msk                 (_UINT32_(0x1) << FEATURE_CTRL0_PHASE_A_EN_Pos)    /* (FEATURE_CTRL0) Enable Phase A Mask */
#define FEATURE_CTRL0_PHASE_A_EN(value)              (FEATURE_CTRL0_PHASE_A_EN_Msk & (_UINT32_(value) << FEATURE_CTRL0_PHASE_A_EN_Pos))
#define   FEATURE_CTRL0_PHASE_A_EN_DISABLED_Val        _UINT32_(0x0)                           /* (FEATURE_CTRL0) Disable phase */
#define   FEATURE_CTRL0_PHASE_A_EN_ENABLED_Val         _UINT32_(0x1)                           /* (FEATURE_CTRL0) Enable phase */
#define FEATURE_CTRL0_PHASE_B_EN_Pos                 _UINT32_(9)                               /* (FEATURE_CTRL0) Enable Phase B Position */
#define FEATURE_CTRL0_PHASE_B_EN_Msk                 (_UINT32_(0x1) << FEATURE_CTRL0_PHASE_B_EN_Pos)    /* (FEATURE_CTRL0) Enable Phase B Mask */
#define FEATURE_CTRL0_PHASE_B_EN(value)              (FEATURE_CTRL0_PHASE_B_EN_Msk & (_UINT32_(value) << FEATURE_CTRL0_PHASE_B_EN_Pos))
#define   FEATURE_CTRL0_PHASE_B_EN_DISABLED_Val        _UINT32_(0x0)                           /* (FEATURE_CTRL0) Disable phase */
#define   FEATURE_CTRL0_PHASE_B_EN_ENABLED_Val         _UINT32_(0x1)                           /* (FEATURE_CTRL0) Enable phase */
#define FEATURE_CTRL0_PHASE_C_EN_Pos                 _UINT32_(10)                               /* (FEATURE_CTRL0) Enable Phase C Position */
#define FEATURE_CTRL0_PHASE_C_EN_Msk                 (_UINT32_(0x1) << FEATURE_CTRL0_PHASE_C_EN_Pos)    /* (FEATURE_CTRL0) Enable Phase C Mask */
#define FEATURE_CTRL0_PHASE_C_EN(value)              (FEATURE_CTRL0_PHASE_C_EN_Msk & (_UINT32_(value) << FEATURE_CTRL0_PHASE_C_EN_Pos))
#define   FEATURE_CTRL0_PHASE_C_EN_DISABLED_Val        _UINT32_(0x0)                           /* (FEATURE_CTRL0) Disable phase */
#define   FEATURE_CTRL0_PHASE_C_EN_ENABLED_Val         _UINT32_(0x1)                           /* (FEATURE_CTRL0) Enable phase */
#define FEATURE_CTRL0_MAX_INT_SELECT_Pos             _UINT32_(12)                               /* (FEATURE_CTRL0) Max Integration Period Select Position */
#define FEATURE_CTRL0_MAX_INT_SELECT_Msk             (_UINT32_(0x1) << FEATURE_CTRL0_MAX_INT_SELECT_Pos)    /* (FEATURE_CTRL0) Max Integration Period Select Mask */
#define FEATURE_CTRL0_MAX_INT_SELECT(value)          (FEATURE_CTRL0_MAX_INT_SELECT_Msk & (_UINT32_(value) << FEATURE_CTRL0_MAX_INT_SELECT_Pos))
#define   FEATURE_CTRL0_MAX_INT_SELECT_CL1_Val          _UINT32_(0x0)                           /* (FEATURE_CTRL0) Metrology DSP will integrate for an integral number of cycles closest to 1 second */
#define   FEATURE_CTRL0_MAX_INT_SELECT_NGT1_Val         _UINT32_(0x1)                           /* (FEATURE_CTRL0) Metrology DSP will integrate for an integral number of cycles no greater than 1 second */
#define FEATURE_CTRL0_F9_PULSE_SEL_Pos             _UINT32_(15)                               /* (FEATURE_CTRL0) METER_TYPE_09 Pulse Select Position */
#define FEATURE_CTRL0_F9_PULSE_SEL_Msk             (_UINT32_(0x1) << FEATURE_CTRL0_F9_PULSE_SEL_Pos)    /* (FEATURE_CTRL0) METER_TYPE_09 Pulse Select Mask */
#define FEATURE_CTRL0_F9_PULSE_SEL(value)          (FEATURE_CTRL0_F9_PULSE_SEL_Msk & (_UINT32_(value) << FEATURE_CTRL0_F9_PULSE_SEL_Pos))
#define   FEATURE_CTRL0_F9_PULSE_SEL_A_Val           _UINT32_(0x0)                           /* (FEATURE_CTRL0) Metrology pulsing computed only using ?phase-A? quantities (V1*I1) */
#define   FEATURE_CTRL0_F9_PULSE_SEL_B_Val           _UINT32_(0x1)                           /* (FEATURE_CTRL0) Metrology pulsing computed only using ?phase-B? quantities (V1*I0) */
#define FEATURE_CTRL0_SWAP_B_and_C_Pos             _UINT32_(16)                              /* (FEATURE_CTRL0) Swap processing channels Position */
#define FEATURE_CTRL0_SWAP_B_and_C_Msk             (_UINT32_(0x1) << FEATURE_CTRL0_SWAP_B_and_C_Pos)    /* (FEATURE_CTRL0) Swap processing channels Mask */
#define FEATURE_CTRL0_SWAP_B_and_C(value)          (FEATURE_CTRL0_SWAP_B_and_C_Msk & (_UINT32_(value) << FEATURE_CTRL0_SWAP_B_and_C_Pos))
#define   FEATURE_CTRL0_SWAP_B_and_C_I2IB_Val        _UINT32_(0x0)                           /* (FEATURE_CTRL0) DSP input mapping: I2/V2 mapped I_B/V_B; I3/V3 mapped I_C/V_C (default) */
#define   FEATURE_CTRL0_SWAP_B_and_C_I2IC_Val        _UINT32_(0x1)                           /* (FEATURE_CTRL0) DSP input mapping: I2/V2 mapped I_C/V_C; I3/V3 mapped I_B/V_B */

