Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- FEATURE_CTRL1 : (MET_CONTROL Offset: 0x08) (R/W 32) Metrology feature setting register 1 -------- */
#define FEATURE_CTRL1_CREEP_I_EN_Pos             _UINT32_(0)                                 /* (FEATURE_CTRL1) Current Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_I_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_I_EN_Pos)    /* (FEATURE_CTRL1) Current Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_I_EN(value)          (FEATURE_CTRL1_CREEP_I_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_I_EN_Pos))
#define   FEATURE_CTRL1_CREEP_I_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable current creep threshold feature */
#define   FEATURE_CTRL1_CREEP_I_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable current creep threshold feature */
#define FEATURE_CTRL1_CREEP_Q_EN_Pos             _UINT32_(1)                                 /* (FEATURE_CTRL1) Reactive Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_Q_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_Q_EN_Pos)    /* (FEATURE_CTRL1) Reactive Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_Q_EN(value)          (FEATURE_CTRL1_CREEP_Q_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_Q_EN_Pos))
#define   FEATURE_CTRL1_CREEP_Q_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable Reactive creep threshold feature */
#define   FEATURE_CTRL1_CREEP_Q_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable Reactive creep threshold feature */
#define FEATURE_CTRL1_CREEP_P_EN_Pos             _UINT32_(2)                                 /* (FEATURE_CTRL1) Active Creep Threshold Function Enable Position */
#define FEATURE_CTRL1_CREEP_P_EN_Msk             (_UINT32_(0x1) << FEATURE_CTRL1_CREEP_P_EN_Pos)    /* (FEATURE_CTRL1) Active Creep Threshold Function Enable Mask */
#define FEATURE_CTRL1_CREEP_P_EN(value)          (FEATURE_CTRL1_CREEP_P_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_CREEP_P_EN_Pos))
#define   FEATURE_CTRL1_CREEP_P_EN_DISABLED_Val    _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable Active creep threshold feature */
#define   FEATURE_CTRL1_CREEP_P_EN_ENABLED_Val     _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable Active creep threshold feature */
#define FEATURE_CTRL1_Ni_DATA_SEL_Pos            _UINT32_(7)                                 /* (FEATURE_CTRL1) Imputed Neutral Current Data Select Position */
#define FEATURE_CTRL1_Ni_DATA_SEL_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_Ni_DATA_SEL_Pos)    /* (FEATURE_CTRL1) Imputed Neutral Current Data Select Mask */
#define FEATURE_CTRL1_Ni_DATA_SEL(value)         (FEATURE_CTRL1_Ni_DATA_SEL_Msk & (_UINT32_(value) << FEATURE_CTRL1_Ni_DATA_SEL_Pos))
#define   FEATURE_CTRL1_Ni_DATA_SEL_BEFORE_Val     _UINT32_(0x0)                             /* (FEATURE_CTRL1) Select imputed neutral current source before FT  */
#define   FEATURE_CTRL1_Ni_DATA_SEL_AFTER_Val      _UINT32_(0x1)                             /* (FEATURE_CTRL1) Select imputed neutral current source after FT  */
#define FEATURE_CTRL1_HARMONIC_m_REQ_Pos            _UINT32_(8)                              /* (FEATURE_CTRL1) Request number of harmonic for analysis Position */
#define FEATURE_CTRL1_HARMONIC_m_REQ_Msk            (_UINT32_(0x3F) << FEATURE_CTRL1_HARMONIC_m_REQ_Pos)    /* (FEATURE_CTRL1) Request number of harmonic for analysis Mask */
#define FEATURE_CTRL1_HARMONIC_m_REQ(value)         (FEATURE_CTRL1_HARMONIC_m_REQ_Msk & (_UINT32_(value) << FEATURE_CTRL1_HARMONIC_m_REQ_Pos))
#define FEATURE_CTRL1_HARMONIC_EN_Pos            _UINT32_(15)                                /* (FEATURE_CTRL1) Enable Harmonic Analysis Position */
#define FEATURE_CTRL1_HARMONIC_EN_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_HARMONIC_EN_Pos)    /* (FEATURE_CTRL1) Enable Harmonic Analysis Mask */
#define FEATURE_CTRL1_HARMONIC_EN(value)         (FEATURE_CTRL1_HARMONIC_EN_Msk & (_UINT32_(value) << FEATURE_CTRL1_HARMONIC_EN_Pos))
#define   FEATURE_CTRL1_HARMONIC_EN_DISABLED_Val   _UINT32_(0x0)                             /* (FEATURE_CTRL1) Disable harmonic analysis  */
#define   FEATURE_CTRL1_HARMONIC_EN_ENABLED_Val    _UINT32_(0x1)                             /* (FEATURE_CTRL1) Enable harmonic analysis  */
#define FEATURE_CTRL1_I_MAX_RESET_Pos            _UINT32_(19)                                /* (FEATURE_CTRL1) Reset All I_x_MAX values Position */
#define FEATURE_CTRL1_I_MAX_RESET_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_I_MAX_RESET_Pos)    /* (FEATURE_CTRL1) Reset All I_x_MAX values Mask */
#define FEATURE_CTRL1_I_MAX_RESET(value)         (FEATURE_CTRL1_I_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL1_I_MAX_RESET_Pos))
#define FEATURE_CTRL1_V_MAX_RESET_Pos            _UINT32_(23)                                /* (FEATURE_CTRL1) Reset All V_x_MAX values Position */
#define FEATURE_CTRL1_V_MAX_RESET_Msk            (_UINT32_(0x1) << FEATURE_CTRL1_V_MAX_RESET_Pos)    /* (FEATURE_CTRL1) Reset All V_x_MAX values Mask */
#define FEATURE_CTRL1_V_MAX_RESET(value)         (FEATURE_CTRL1_V_MAX_RESET_Msk & (_UINT32_(value) << FEATURE_CTRL1_V_MAX_RESET_Pos))

/* -------- METER_TYPE : (MET_CONTROL Offset: 0x0C) (R/W  32) Sensor type and service type settings register -------- */
#define METER_TYPE_SENSOR_TYPE_I_A_Pos             _UINT32_(0)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_A_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_A_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_A(value)          (METER_TYPE_SENSOR_TYPE_I_A_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_A_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_A_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_A_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_A_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_A_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_A_Pos             _UINT32_(2)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_A_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_A_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_A(value)          (METER_TYPE_SENSOR_TYPE_V_A_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_A_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_A_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_A_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_A_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_A_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_I_B_Pos             _UINT32_(4)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_B_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_B_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_B(value)          (METER_TYPE_SENSOR_TYPE_I_B_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_B_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_B_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_B_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_B_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_B_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_B_Pos             _UINT32_(6)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_B_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_B_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_B(value)          (METER_TYPE_SENSOR_TYPE_V_B_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_B_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_B_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_B_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_B_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_B_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_I_C_Pos             _UINT32_(8)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_C_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_C_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_C(value)          (METER_TYPE_SENSOR_TYPE_I_C_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_C_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_C_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_C_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_C_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_C_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_C_Pos             _UINT32_(10)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_C_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_C_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_C(value)          (METER_TYPE_SENSOR_TYPE_V_C_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_C_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_C_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_C_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_C_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_C_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SERVICE_TYPE_Pos                _UINT32_(24)                                 /* (METER_TYPE) Electrical Service Type Position */
#define METER_TYPE_SERVICE_TYPE_Msk                (_UINT32_(0xF) << METER_TYPE_SERVICE_TYPE_Pos)    /* (METER_TYPE) Electrical Service Type Mask */
#define METER_TYPE_SENSOR_TYPE(value)             (METER_TYPE_SERVICE_TYPE_Msk & (_UINT32_(value) << METER_TYPE_SERVICE_TYPE_Pos))
#define   METER_TYPE_SERVICE_TYPE_3P4WY_3E_3V3I_Val          _UINT32_(0x0)                      /* (METER_TYPE) Three-phase 4-wire Wye (3-element) */
#define   METER_TYPE_SERVICE_TYPE_3P4WD_3E_3V3I_Val          _UINT32_(0x1)                      /* (METER_TYPE) Three-phase 4-wire Delta (3-element) */
#define   METER_TYPE_SERVICE_TYPE_3P3P4WY_2p5E_2V3I_Val      _UINT32_(0x2)                      /* (METER_TYPE) Three-phase 4-wire Wye (2-½ element) */
#define   METER_TYPE_SERVICE_TYPE_3P4WD_2E_3V2I_Val          _UINT32_(0x3)                      /* (METER_TYPE) Three-phase 4-wire Delta (2-element) */
#define   METER_TYPE_SERVICE_TYPE_3P3WD_2E_2V2I_Val          _UINT32_(0x4)                      /* (METER_TYPE) Three-phase 3-wire) Delta (2-element) */
#define   METER_TYPE_SERVICE_TYPE_2P3W_2E_2V2I_Val           _UINT32_(0x5)                      /* (METER_TYPE) Two-phase 3-wire Network (2 element) */
#define   METER_TYPE_SERVICE_TYPE_1P3W_1p5E_1V2I_Val         _UINT32_(0x6)                      /* (METER_TYPE) Single-phase 3-wire (1-½ element) */
#define   METER_TYPE_SERVICE_TYPE_1P2W_1E_1V1I_Val           _UINT32_(0x7)                      /* (METER_TYPE) Single-phase 2-wire (1 element) */
#define   METER_TYPE_SERVICE_TYPE_1P3W_1E_2V1I_Val           _UINT32_(0x8)                      /* (METER_TYPE) Single-phase 3-wire (1 element) */
#define   METER_TYPE_SERVICE_TYPE_1P2W_1E_1V2I_I0_Val        _UINT32_(0x9)                      /* (METER_TYPE) I0 Single-phase 2-wire using I0 (1 element) */
#define   METER_TYPE_SERVICE_TYPE_2P3W_2E_2V2I_I0_Val        _UINT32_(0xA)                      /* (METER_TYPE) I0 Two-phase 3-wire Network using I0 (2 element) */
#define METER_TYPE_MISSING_PHASE_Pos               _UINT32_(28)                                 /* (METER_TYPE) Missing phase voltage select Position */
#define METER_TYPE_MISSING_PHASE_Msk               (_UINT32_(0x3) << METER_TYPE_MISSING_PHASE_Pos)    /* (METER_TYPE) Missing phase voltage select Mask */
#define METER_TYPE_MISSING_PHASE(value)            (METER_TYPE_MISSING_PHASE_Msk & (_UINT32_(value) << METER_TYPE_MISSING_PHASE_Pos))
#define   METER_TYPE_MISSING_PHASE_A_Val             _UINT32_(0x0)                             /* (METER_TYPE) Generate missing phase voltage for Phase_A */
#define   METER_TYPE_MISSING_PHASE_B_Val             _UINT32_(0x1)                             /* (METER_TYPE) Generate missing phase voltage for Phase_B */
#define   METER_TYPE_MISSING_PHASE_C_Val             _UINT32_(0x2)                             /* (METER_TYPE) Generate missing phase voltage for Phase_C */
#define METER_TYPE_Dto4WY_TRANSFORM_Pos            _UINT32_(31)                                 /* (METER_TYPE) Transformation to equivalent 4WY Position */
#define METER_TYPE_Dto4WY_TRANSFORM_Msk            (_UINT32_(0x1) << METER_TYPE_Dto4WY_TRANSFORM_Pos)    /* (METER_TYPE) Transformation to equivalent 4WY Mask */
#define METER_TYPE_Dto4WY_TRANSFORM(value)         (METER_TYPE_Dto4WY_TRANSFORM_Msk & (_UINT32_(value) << METER_TYPE_Dto4WY_TRANSFORM_Pos))
#define   METER_TYPE_Dto4WY_TRANSFORM_DISABLED_Val   _UINT32_(0x0)                             /* (METER_TYPE) Phase voltages remain in native service (no transformation) */
#define   METER_TYPE_Dto4WY_TRANSFORM_ENABLED_Val    _UINT32_(0x1)                             /* (METER_TYPE) Phase voltages transformed into an equivalent 4-wire Wye service */

/* -------- M : (MET_CONTROL Offset: 0x10) (R/W  32) Number of line cycles for integration period (uQ12.0) -------- */
#define M_Pos                                      _UINT32_(0)                                 /* (M) Number of cycles of the integration period Position */
#define M_Msk                                      (_UINT32_(0xFFF) << M_Pos)                  /* (M) Number of cycles of the integration period Mask */
#define M_M(value)                                   (M_Msk & (_UINT32_(value) << M_Pos))

/* -------- N_MAX : (MET_CONTROL Offset: 0x14) (R/W  32) Maximum number of samples in an integration period (uQ24.0) -------- */
#define N_MAX_Pos                                 _UINT32_(0)                                  /* (N_MAX) Maximum number of samples in an integration period Position */
#define N_MAX_Msk                                 (_UINT32_(0xFFF) << N_MAX_Pos)               /* (N_MAX) Maximum number of samples in an integration period Mask */
#define N_MAX(value)                              (N_MAX_Msk & (_UINT32_(value) << N_MAX_Pos))

