Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- PULSE0_CTRL : (MET_CONTROL Offset: 0x18) (R/W  32) Pulse 0 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE0_CTRL_PC0_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE0_CTRL) Pulse Width  */
#define PULSE0_CTRL_PC0_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE0_CTRL_PC0_WIDTH_Pos)      /* (PULSE0_CTRL) Pulse Width  */
#define PULSE0_CTRL_PC0_WIDTH(value)               (PULSE0_CTRL_PC0_WIDTH_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_WIDTH_Pos))
#define PULSE0_CTRL_PC0_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE0_CTRL) Pulse Type Selection Position */
#define PULSE0_CTRL_PC0_TYPE_Msk                  (_UINT32_(0xF) << PULSE0_CTRL_PC0_TYPE_Pos)      /* (PULSE0_CTRL) Pulse Type Selection Mask */
#define PULSE0_CTRL_PC0_TYPE(value)               (PULSE0_CTRL_PC0_TYPE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_TYPE_Pos))
#define   PULSE0_CTRL_PC0_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE0_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE0_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE0_CTRL_PC0_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE0_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE0_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE0_CTRL_PC0_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE0_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE0_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define PULSE0_CTRL_PC0_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE0_CTRL) Pulse Polarity Position  */
#define PULSE0_CTRL_PC0_POLARITY_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_POLARITY_Pos)      /* (PULSE0_CTRL) Pulse Polarity Mask  */
#define PULSE0_CTRL_PC0_POLARITY(value)            (PULSE0_CTRL_PC0_POLARITY_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_POLARITY_Pos))
#define   PULSE0_CTRL_PC0_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE0_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE0_CTRL_PC0_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE0_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE0_CTRL_PC0_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE0_CTRL) Pulse Override Control Position  */
#define PULSE0_CTRL_PC0_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_OVERRIDE_Pos)      /* (PULSE0_CTRL) Pulse Override Control Mask  */
#define PULSE0_CTRL_PC0_OVERRIDE(value)            (PULSE0_CTRL_PC0_OVERRIDE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_OVERRIDE_Pos))
#define   PULSE0_CTRL_PC0_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse generation functions as normal */
#define   PULSE0_CTRL_PC0_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse generation is temporarily disabled */
#define PULSE0_CTRL_PC0_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE0_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE0_CTRL_PC0_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_ACC_HOLD_Pos)      /* (PULSE0_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE0_CTRL_PC0_ACC_HOLD(value)            (PULSE0_CTRL_PC0_ACC_HOLD_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_ACC_HOLD_Pos))
#define   PULSE0_CTRL_PC0_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE0_CTRL_PC0_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse accumulation is held static */
#define PULSE0_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE0_CTRL) Open Drain Enable Position  */
#define PULSE0_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE0_CTRL_OPD_ENABLE_Pos)   /* (PULSE0_CTRL) Open Drain Enable Mask  */
#define PULSE0_CTRL_OPD_ENABLE(value)              (PULSE0_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_OPD_ENABLE_Pos))
#define   PULSE0_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE0_CTRL) The open drain is disabled */
#define   PULSE0_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE0_CTRL) The open drain is enabled */
#define PULSE0_CTRL_PC0_DETENT_Pos                 _UINT32_(28)                                /* (PULSE0_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE0_CTRL_PC0_DETENT_Msk                 (_UINT32_(0x3) << PULSE0_CTRL_PC0_DETENT_Pos)   /* (PULSE0_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE0_CTRL_PC0_DETENT(value)              (PULSE0_CTRL_PC0_DETENT_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_DETENT_Pos))
#define   PULSE0_CTRL_PC0_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE0_CTRL_PC0_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE0_CTRL_PC0_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE0_CTRL_PC0_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE0_CTRL) Pulses generated based on (energy generated only) */
#define PULSE0_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE0_CTRL) Pull-Up Enable Position  */
#define PULSE0_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE0_CTRL_PU_ENABLE_Pos)   /* (PULSE0_CTRL) Pull-Up Enable Mask  */
#define PULSE0_CTRL_PU_ENABLE(value)               (PULSE0_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_PU_ENABLE_Pos))
#define   PULSE0_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE0_CTRL) Pull-Up disabled */
#define   PULSE0_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE0_CTRL) Pull-Up enabled */
#define PULSE0_CTRL_PC0_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE0_CTRL) Output Pulse Enable Position  */
#define PULSE0_CTRL_PC0_ENABLE_Msk                 (_UINT32_(0x1) << PULSE0_CTRL_PC0_ENABLE_Pos)   /* (PULSE0_CTRL) Output Pulse Enable Mask  */
#define PULSE0_CTRL_PC0_ENABLE(value)              (PULSE0_CTRL_PC0_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_ENABLE_Pos))
#define   PULSE0_CTRL_PC0_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE0_CTRL_PC0_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse output enabled */

/* -------- PULSE1_CTRL : (MET_CONTROL Offset: 0x18) (R/W  32) Pulse 1 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE1_CTRL_PC1_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE1_CTRL) Pulse Width  */
#define PULSE1_CTRL_PC1_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE1_CTRL_PC1_WIDTH_Pos)      /* (PULSE1_CTRL) Pulse Width  */
#define PULSE1_CTRL_PC1_WIDTH(value)               (PULSE1_CTRL_PC1_WIDTH_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_WIDTH_Pos))
#define PULSE1_CTRL_PC1_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE1_CTRL) Pulse Type Selection Position */
#define PULSE1_CTRL_PC1_TYPE_Msk                  (_UINT32_(0xF) << PULSE1_CTRL_PC1_TYPE_Pos)      /* (PULSE1_CTRL) Pulse Type Selection Mask */
#define PULSE1_CTRL_PC1_TYPE(value)               (PULSE1_CTRL_PC1_TYPE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_TYPE_Pos))
#define   PULSE1_CTRL_PC1_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE1_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE1_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE1_CTRL_PC1_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE1_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE1_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE1_CTRL_PC1_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE1_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE1_CTRL_PC1_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE1_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define PULSE1_CTRL_PC1_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE1_CTRL) Pulse Polarity Position  */
#define PULSE1_CTRL_PC1_POLARITY_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_POLARITY_Pos)      /* (PULSE1_CTRL) Pulse Polarity Mask  */
#define PULSE1_CTRL_PC1_POLARITY(value)            (PULSE1_CTRL_PC1_POLARITY_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_POLARITY_Pos))
#define   PULSE1_CTRL_PC1_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE1_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE1_CTRL_PC1_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE1_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE1_CTRL_PC1_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE1_CTRL) Pulse Override Control Position  */
#define PULSE1_CTRL_PC1_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_OVERRIDE_Pos)      /* (PULSE1_CTRL) Pulse Override Control Mask  */
#define PULSE1_CTRL_PC1_OVERRIDE(value)            (PULSE1_CTRL_PC1_OVERRIDE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_OVERRIDE_Pos))
#define   PULSE1_CTRL_PC1_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse generation functions as normal */
#define   PULSE1_CTRL_PC1_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse generation is temporarily disabled */
#define PULSE1_CTRL_PC1_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE1_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE1_CTRL_PC1_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE1_CTRL_PC1_ACC_HOLD_Pos)      /* (PULSE1_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE1_CTRL_PC1_ACC_HOLD(value)            (PULSE1_CTRL_PC1_ACC_HOLD_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_ACC_HOLD_Pos))
#define   PULSE1_CTRL_PC1_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE1_CTRL_PC1_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse accumulation is held static */
#define PULSE1_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE1_CTRL) Open Drain Enable Position  */
#define PULSE1_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE1_CTRL_OPD_ENABLE_Pos)   /* (PULSE1_CTRL) Open Drain Enable Mask  */
#define PULSE1_CTRL_OPD_ENABLE(value)              (PULSE1_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_OPD_ENABLE_Pos))
#define   PULSE1_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE1_CTRL) The open drain is disabled */
#define   PULSE1_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE1_CTRL) The open drain is enabled */
#define PULSE1_CTRL_PC1_DETENT_Pos                 _UINT32_(28)                                /* (PULSE1_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE1_CTRL_PC1_DETENT_Msk                 (_UINT32_(0x3) << PULSE1_CTRL_PC1_DETENT_Pos)   /* (PULSE1_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE1_CTRL_PC1_DETENT(value)              (PULSE1_CTRL_PC1_DETENT_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_DETENT_Pos))
#define   PULSE1_CTRL_PC1_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE1_CTRL_PC1_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE1_CTRL_PC1_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE1_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE1_CTRL_PC1_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE1_CTRL) Pulses generated based on (energy generated only) */
#define PULSE1_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE1_CTRL) Pull-Up Enable Position  */
#define PULSE1_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE1_CTRL_PU_ENABLE_Pos)   /* (PULSE1_CTRL) Pull-Up Enable Mask  */
#define PULSE1_CTRL_PU_ENABLE(value)               (PULSE1_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_PU_ENABLE_Pos))
#define   PULSE1_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE1_CTRL) Pull-Up disabled */
#define   PULSE1_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE1_CTRL) Pull-Up enabled */
#define PULSE1_CTRL_PC1_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE1_CTRL) Output Pulse Enable Position  */
#define PULSE1_CTRL_PC1_ENABLE_Msk                 (_UINT32_(0x1) << PULSE1_CTRL_PC1_ENABLE_Pos)   /* (PULSE1_CTRL) Output Pulse Enable Mask  */
#define PULSE1_CTRL_PC1_ENABLE(value)              (PULSE1_CTRL_PC1_ENABLE_Msk & (_UINT32_(value) << PULSE1_CTRL_PC1_ENABLE_Pos))
#define   PULSE1_CTRL_PC1_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE1_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE1_CTRL_PC1_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE1_CTRL) Pulse output enabled */

