Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- PULSE2_CTRL : (MET_CONTROL Offset: 0x18) (R/W  32) Pulse 2 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE2_CTRL_PC2_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE2_CTRL) Pulse Width  */
#define PULSE2_CTRL_PC2_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE2_CTRL_PC2_WIDTH_Pos)      /* (PULSE2_CTRL) Pulse Width  */
#define PULSE2_CTRL_PC2_WIDTH(value)               (PULSE2_CTRL_PC2_WIDTH_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_WIDTH_Pos))
#define PULSE2_CTRL_PC2_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE2_CTRL) Pulse Type Selection Position */
#define PULSE2_CTRL_PC2_TYPE_Msk                  (_UINT32_(0xF) << PULSE2_CTRL_PC2_TYPE_Pos)      /* (PULSE2_CTRL) Pulse Type Selection Mask */
#define PULSE2_CTRL_PC2_TYPE(value)               (PULSE2_CTRL_PC2_TYPE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_TYPE_Pos))
#define   PULSE2_CTRL_PC2_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE2_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE2_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE2_CTRL_PC2_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE2_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE2_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE2_CTRL_PC2_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE2_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE2_CTRL_PC2_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE2_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define PULSE2_CTRL_PC2_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE2_CTRL) Pulse Polarity Position  */
#define PULSE2_CTRL_PC2_POLARITY_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_POLARITY_Pos)      /* (PULSE2_CTRL) Pulse Polarity Mask  */
#define PULSE2_CTRL_PC2_POLARITY(value)            (PULSE2_CTRL_PC2_POLARITY_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_POLARITY_Pos))
#define   PULSE2_CTRL_PC2_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE2_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE2_CTRL_PC2_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE2_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE2_CTRL_PC2_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE2_CTRL) Pulse Override Control Position  */
#define PULSE2_CTRL_PC2_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_OVERRIDE_Pos)      /* (PULSE2_CTRL) Pulse Override Control Mask  */
#define PULSE2_CTRL_PC2_OVERRIDE(value)            (PULSE2_CTRL_PC2_OVERRIDE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_OVERRIDE_Pos))
#define   PULSE2_CTRL_PC2_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse generation functions as normal */
#define   PULSE2_CTRL_PC2_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse generation is temporarily disabled */
#define PULSE2_CTRL_PC2_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE2_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE2_CTRL_PC2_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE2_CTRL_PC2_ACC_HOLD_Pos)      /* (PULSE2_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE2_CTRL_PC2_ACC_HOLD(value)            (PULSE2_CTRL_PC2_ACC_HOLD_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_ACC_HOLD_Pos))
#define   PULSE2_CTRL_PC2_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE2_CTRL_PC2_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse accumulation is held static */
#define PULSE2_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE2_CTRL) Open Drain Enable Position  */
#define PULSE2_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE2_CTRL_OPD_ENABLE_Pos)   /* (PULSE2_CTRL) Open Drain Enable Mask  */
#define PULSE2_CTRL_OPD_ENABLE(value)              (PULSE2_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_OPD_ENABLE_Pos))
#define   PULSE2_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE2_CTRL) The open drain is disabled */
#define   PULSE2_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE2_CTRL) The open drain is enabled */
#define PULSE2_CTRL_PC2_DETENT_Pos                 _UINT32_(28)                                /* (PULSE2_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE2_CTRL_PC2_DETENT_Msk                 (_UINT32_(0x3) << PULSE2_CTRL_PC2_DETENT_Pos)   /* (PULSE2_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE2_CTRL_PC2_DETENT(value)              (PULSE2_CTRL_PC2_DETENT_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_DETENT_Pos))
#define   PULSE2_CTRL_PC2_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE2_CTRL_PC2_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE2_CTRL_PC2_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE2_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE2_CTRL_PC2_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE2_CTRL) Pulses generated based on (energy generated only) */
#define PULSE2_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE2_CTRL) Pull-Up Enable Position  */
#define PULSE2_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE2_CTRL_PU_ENABLE_Pos)   /* (PULSE2_CTRL) Pull-Up Enable Mask  */
#define PULSE2_CTRL_PU_ENABLE(value)               (PULSE2_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_PU_ENABLE_Pos))
#define   PULSE2_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE2_CTRL) Pull-Up disabled */
#define   PULSE2_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE2_CTRL) Pull-Up enabled */
#define PULSE2_CTRL_PC2_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE2_CTRL) Output Pulse Enable Position  */
#define PULSE2_CTRL_PC2_ENABLE_Msk                 (_UINT32_(0x1) << PULSE2_CTRL_PC2_ENABLE_Pos)   /* (PULSE2_CTRL) Output Pulse Enable Mask  */
#define PULSE2_CTRL_PC2_ENABLE(value)              (PULSE2_CTRL_PC2_ENABLE_Msk & (_UINT32_(value) << PULSE2_CTRL_PC2_ENABLE_Pos))
#define   PULSE2_CTRL_PC2_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE2_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE2_CTRL_PC2_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE2_CTRL) Pulse output enabled */

/* -------- P_K_t : (MET_CONTROL Offset: 0x24) (R/W  32) Meter Active Power Pulse Constant (uQ8.24) -------- */
#define P_K_t_Pos                                  _UINT32_(0)                                 /* (P_K_t) Meter Active Power Pulse Constant Position */
#define P_K_t_Msk                                  (_UINT32_(0xFFFFFFFF) << P_K_t_Pos)         /* (P_K_t) Meter Active Power Pulse Constant Mask */
#define P_K_t(value)                               (P_K_t_Msk & (_UINT32_(value) << P_K_t_Pos))

