Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- CAL_PH_IC : (MET_CONTROL Offset: 0xA8) (R/W  32) Current phase calibration constant, I_C (sQ2.29) -------- */
#define CAL_PH_IC_Pos                             _UINT32_(0)                                 /* (CAL_PH_IC) Current phase calibration constant Position */
#define CAL_PH_IC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IC_Pos)      /* (CAL_PH_IC) Current phase calibration constant Mask */
#define CAL_PH_IC(value)                          (CAL_PH_IC_Msk & (_UINT32_(value) << CAL_PH_IC_Pos))

/* -------- CAL_PH_VC : (MET_CONTROL Offset: 0xAC) (R/W  32) Voltage phase calibration constant, V_C (sQ2.29) -------- */
#define CAL_PH_VC_Pos                             _UINT32_(0)                                 /* (CAL_PH_VC) Voltage phase calibration constant Position */
#define CAL_PH_VC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_VC_Pos)      /* (CAL_PH_VC) Voltage phase calibration constant Mask */
#define CAL_PH_VC(value)                          (CAL_PH_VC_Msk & (_UINT32_(value) << CAL_PH_VC_Pos))

/* -------- CAL_PH_IN : (MET_CONTROL Offset: 0xB0) (R/W  32) Current phase calibration constant, I_N (sQ2.29) -------- */
#define CAL_PH_IN_Pos                             _UINT32_(0)                                 /* (CAL_PH_IN) Current phase calibration constant Position */
#define CAL_PH_IN_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IN_Pos)      /* (CAL_PH_IN) Current phase calibration constant Mask */
#define CAL_PH_IN(value)                          (CAL_PH_IN_Msk & (_UINT32_(value) << CAL_PH_IN_Pos))

/* -------- CAPTURE_CTRL : (MET_CONTROL Offset: 0xB4) (R/W  32) Waveform capture control register -------- */
#define CAPTURE_CTRL_CAPTURE_TYPE_Pos             _UINT32_(0)                                 /* (CAPTURE_CTRL) Waveform capture control register Position */
#define CAPTURE_CTRL_CAPTURE_TYPE_Msk             (_UINT32_(0x3) << CAPTURE_CTRL_CAPTURE_TYPE_Pos)         /* (CAPTURE_CTRL) Waveform capture control register Mask */
#define CAPTURE_CTRL_CAPTURE_TYPE(value)          (CAPTURE_CTRL_CAPTURE_TYPE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_TYPE_Pos))
#define   CAPTURE_CTRL_CAPTURE_TYPE_ONE_SHOT_Val    _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture will stop after capture finishes or is disabled */
#define   CAPTURE_CTRL_CAPTURE_TYPE_CONTINUOS_Val   _UINT32_(0x1)                   /* (CAPTURE_CTRL) Continuous capture of waveform data in circular-buffer fashion */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Pos           _UINT32_(4)                                 /* (CAPTURE_CTRL) Capture Source Select Position */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Msk           (_UINT32_(0x7) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos)         /* (CAPTURE_CTRL) Capture Source Select Mask */
#define CAPTURE_CTRL_CAPTURE_SOURCE(value)        (CAPTURE_CTRL_CAPTURE_SOURCE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos))
#define   CAPTURE_CTRL_CAPTURE_SOURCE_16KHz_Val     _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture 16kHz data [sQ1.30] before DSP filtering */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_FBW_Val  _UINT32_(0x1)                   /* (CAPTURE_CTRL) Capture 4kHz FBW data [sQ2.29] (Full Bandwidth = fundamental + harmonics) */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_NBW_Val  _UINT32_(0x2)                   /* (CAPTURE_CTRL) Capture 4kHz NBW data [sQ2.29] (Narrow Bandwidth = fundamental only) */
#define CAPTURE_CTRL_CH_SEL_IA_Pos                _UINT32_(8)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IA(value)             (CAPTURE_CTRL_CH_SEL_IA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IA_Pos))
#define   CAPTURE_CTRL_CH_SEL_IA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VA_Pos                _UINT32_(9)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VA(value)             (CAPTURE_CTRL_CH_SEL_VA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VA_Pos))
#define   CAPTURE_CTRL_CH_SEL_VA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IB_Pos                _UINT32_(10)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IB(value)             (CAPTURE_CTRL_CH_SEL_IB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IB_Pos))
#define   CAPTURE_CTRL_CH_SEL_IB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VB_Pos                _UINT32_(11)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VB(value)             (CAPTURE_CTRL_CH_SEL_VB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VB_Pos))
#define   CAPTURE_CTRL_CH_SEL_VB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IC_Pos                _UINT32_(12)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IC(value)             (CAPTURE_CTRL_CH_SEL_IC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IC_Pos))
#define   CAPTURE_CTRL_CH_SEL_IC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VC_Pos                _UINT32_(13)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VC(value)             (CAPTURE_CTRL_CH_SEL_VC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VC_Pos))
#define   CAPTURE_CTRL_CH_SEL_VC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CAPTURE_EN_Pos                _UINT32_(31)                                 /* (CAPTURE_CTRL) Enable waveform capture Position */
#define CAPTURE_CTRL_CAPTURE_EN_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CAPTURE_EN_Pos)         /* (CAPTURE_CTRL) Enable waveform capture Mask */
#define CAPTURE_CTRL_CAPTURE_EN(value)             (CAPTURE_CTRL_CAPTURE_EN_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_EN_Pos))
#define   CAPTURE_CTRL_CAPTURE_EN_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture feature is disabled  */
#define   CAPTURE_CTRL_CAPTURE_EN_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture feature is enabled */

