Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- CAPTURE_BUFF_SIZE : (MET_CONTROL Offset: 0xB8) (R/W  32) Waveform capture buffer size in units of 32-bits -------- */
#define CAPTURE_BUFF_SIZE_Pos                      _UINT32_(0)                                 /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Position */
#define CAPTURE_BUFF_SIZE_Msk                      (_UINT32_(0xFFFFFF) << CAPTURE_BUFF_SIZE_Pos)      /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Mask */
#define CAPTURE_BUFF_SIZE(value)                   (CAPTURE_BUFF_SIZE_Msk & (_UINT32_(value) << CAPTURE_BUFF_SIZE_Pos))

/* -------- CAPTURE_ADDR_SIZE : (MET_CONTROL Offset: 0xBC) (R/W  32) Waveform capture buffer address pointer -------- */
#define CAPTURE_ADDR_SIZE_Pos                      _UINT32_(0)                                 /* (CAPTURE_ADDR_SIZE) Waveform capture buffer address pointer Position */
#define CAPTURE_ADDR_SIZE_Msk                      (_UINT32_(0xFFFFFFFF) << CAPTURE_ADDR_SIZE_Pos)      /* (CAPTURE_ADDR_SIZE) Waveform capture buffer address pointer Mask */
#define CAPTURE_ADDR_SIZE(value)                   (CAPTURE_ADDR_SIZE_Msk & (_UINT32_(value) << CAPTURE_ADDR_SIZE_Pos))

/* -------- ATSENSE_CTRL_20_23 : (MET_CONTROL Offset: 0xCC) (R/W  32) ATSense control: channels I0,I1,V1,I2 -------- */
#define ATSENSE_CTRL_20_23_I0_ON_Pos                _UINT32_(0)                                 /* (ATSENSE_CTRL_20_23) Enable channel I0 Position */
#define ATSENSE_CTRL_20_23_I0_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I0_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I0 Mask */
#define ATSENSE_CTRL_20_23_I0_ON(value)             (ATSENSE_CTRL_20_23_I0_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I0_ON_Pos))
#define   ATSENSE_CTRL_20_23_I0_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I0_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_TEMPMEAS_Pos             _UINT32_(1)                                 /* (ATSENSE_CTRL_20_23) Channel I0/Temperature multiplex select bit Position */
#define ATSENSE_CTRL_20_23_TEMPMEAS_Msk             (_UINT32_(0x1) << ATSENSE_CTRL_20_23_TEMPMEAS_Pos)         /* (ATSENSE_CTRL_20_23) Channel I0/Temperature multiplex select bit Mask */
#define ATSENSE_CTRL_20_23_TEMPMEAS(value)          (ATSENSE_CTRL_20_23_TEMPMEAS_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_TEMPMEAS_Pos))
#define   ATSENSE_CTRL_20_23_TEMPMEAS_CURRENT_I0_Val  _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Measurement of external current I0  */
#define   ATSENSE_CTRL_20_23_TEMPMEAS_TEMP_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Measurement of internal temperature sensor */
#define ATSENSE_CTRL_20_23_I0_GAIN_Pos              _UINT32_(4)                                 /* (ATSENSE_CTRL_20_23) Channel I0 gain Position */
#define ATSENSE_CTRL_20_23_I0_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I0_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I0 gain Mask */
#define ATSENSE_CTRL_20_23_I0_GAIN(value)           (ATSENSE_CTRL_20_23_I0_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I0_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I0_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I0_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I0_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I0_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */
#define ATSENSE_CTRL_20_23_I1_ON_Pos                _UINT32_(8)                                 /* (ATSENSE_CTRL_20_23) Enable channel I1 Position */
#define ATSENSE_CTRL_20_23_I1_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I1_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I1 Mask */
#define ATSENSE_CTRL_20_23_I1_ON(value)             (ATSENSE_CTRL_20_23_I1_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I1_ON_Pos))
#define   ATSENSE_CTRL_20_23_I1_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I1_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I1_GAIN_Pos              _UINT32_(12)                                /* (ATSENSE_CTRL_20_23) Channel I1 gain Position */
#define ATSENSE_CTRL_20_23_I1_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I1_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I1 gain Mask */
#define ATSENSE_CTRL_20_23_I1_GAIN(value)           (ATSENSE_CTRL_20_23_I1_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I1_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I1_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I1_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I1_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I1_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */
#define ATSENSE_CTRL_20_23_V1_ON_Pos                _UINT32_(16)                                 /* (ATSENSE_CTRL_20_23) Enable channel V1 Position */
#define ATSENSE_CTRL_20_23_V1_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_V1_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel V1 Mask */
#define ATSENSE_CTRL_20_23_V1_ON(value)             (ATSENSE_CTRL_20_23_V1_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_V1_ON_Pos))
#define   ATSENSE_CTRL_20_23_V1_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_V1_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I2_ON_Pos                _UINT32_(24)                                 /* (ATSENSE_CTRL_20_23) Enable channel I2 Position */
#define ATSENSE_CTRL_20_23_I2_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I2_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I2 Mask */
#define ATSENSE_CTRL_20_23_I2_ON(value)             (ATSENSE_CTRL_20_23_I2_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I2_ON_Pos))
#define   ATSENSE_CTRL_20_23_I2_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I2_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I2_GAIN_Pos              _UINT32_(28)                                /* (ATSENSE_CTRL_20_23) Channel I2 gain Position */
#define ATSENSE_CTRL_20_23_I2_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I2_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I2 gain Mask */
#define ATSENSE_CTRL_20_23_I2_GAIN(value)           (ATSENSE_CTRL_20_23_I2_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I2_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I2_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I2_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I2_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I2_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */

/* -------- ATSENSE_CTRL_24_27 : (MET_CONTROL Offset: 0xD0) (R/W  32) ATSense control: channels V2,I3,V3,ANA -------- */
#define ATSENSE_CTRL_24_27_V2_ON_Pos                _UINT32_(0)                                 /* (ATSENSE_CTRL_24_27) Enable channel V2 Position */
#define ATSENSE_CTRL_24_27_V2_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_V2_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel V2 Mask */
#define ATSENSE_CTRL_24_27_V2_ON(value)             (ATSENSE_CTRL_24_27_V2_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_V2_ON_Pos))
#define   ATSENSE_CTRL_24_27_V2_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_V2_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_I3_ON_Pos                _UINT32_(8)                                 /* (ATSENSE_CTRL_24_27) Enable channel I3 Position */
#define ATSENSE_CTRL_24_27_I3_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_I3_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel I3 Mask */
#define ATSENSE_CTRL_24_27_I3_ON(value)             (ATSENSE_CTRL_24_27_I3_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_I3_ON_Pos))
#define   ATSENSE_CTRL_24_27_I3_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_I3_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_I3_GAIN_Pos              _UINT32_(12)                                /* (ATSENSE_CTRL_24_27) Channel I3 gain Position */
#define ATSENSE_CTRL_24_27_I3_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_24_27_I3_GAIN_Pos)         /* (ATSENSE_CTRL_24_27) Channel I3 gain Mask */
#define ATSENSE_CTRL_24_27_I3_GAIN(value)           (ATSENSE_CTRL_24_27_I3_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_I3_GAIN_Pos))
#define   ATSENSE_CTRL_24_27_I3_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 1  */
#define   ATSENSE_CTRL_24_27_I3_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 2 */
#define   ATSENSE_CTRL_24_27_I3_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 4 */
#define   ATSENSE_CTRL_24_27_I3_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 8 */
#define ATSENSE_CTRL_24_27_V3_ON_Pos                _UINT32_(16)                                 /* (ATSENSE_CTRL_24_27) Enable channel V3 Position */
#define ATSENSE_CTRL_24_27_V3_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_V3_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel V3 Mask */
#define ATSENSE_CTRL_24_27_V3_ON(value)             (ATSENSE_CTRL_24_27_V3_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_V3_ON_Pos))
#define   ATSENSE_CTRL_24_27_V3_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_V3_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_ONBIAS_Pos                _UINT32_(24)                                 /* (ATSENSE_CTRL_24_27) Enable bias Position */
#define ATSENSE_CTRL_24_27_ONBIAS_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONBIAS_Pos)         /* (ATSENSE_CTRL_24_27) Enable bias Mask */
#define ATSENSE_CTRL_24_27_ONBIAS(value)             (ATSENSE_CTRL_24_27_ONBIAS_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONBIAS_Pos))
#define   ATSENSE_CTRL_24_27_ONBIAS_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Bias is disabled  */
#define   ATSENSE_CTRL_24_27_ONBIAS_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Bias is enabled */
#define ATSENSE_CTRL_24_27_ONREF_Pos                _UINT32_(25)                                 /* (ATSENSE_CTRL_24_27) Enable internal reference Position */
#define ATSENSE_CTRL_24_27_ONREF_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONREF_Pos)         /* (ATSENSE_CTRL_24_27) Enable internal reference Mask */
#define ATSENSE_CTRL_24_27_ONREF(value)             (ATSENSE_CTRL_24_27_ONREF_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONREF_Pos))
#define   ATSENSE_CTRL_24_27_ONREF_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Internal reference is disabled  */
#define   ATSENSE_CTRL_24_27_ONREF_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Internal reference is enabled */
#define ATSENSE_CTRL_24_27_ONLDO_Pos                _UINT32_(26)                                 /* (ATSENSE_CTRL_24_27) Enable internal LDO Position */
#define ATSENSE_CTRL_24_27_ONLDO_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONLDO_Pos)         /* (ATSENSE_CTRL_24_27) Enable internal LDO Mask */
#define ATSENSE_CTRL_24_27_ONLDO(value)             (ATSENSE_CTRL_24_27_ONLDO_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONLDO_Pos))
#define   ATSENSE_CTRL_24_27_ONLDO_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Internal LDO is disabled  */
#define   ATSENSE_CTRL_24_27_ONLDO_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Internal LDO is enabled */

