Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- ATSENSE_CTRL_28_2B : (MET_CONTROL Offset: 0xD4) (R/W  32) ATSense control: Registers: x28, x2A-2B, x2D -------- */
#define ATSENSE_CTRL_28_2B_OSR_Pos                  _UINT32_(0)                                 /* (ATSENSE_CTRL_28_2B) Over Sampling Ratio Position */
#define ATSENSE_CTRL_28_2B_OSR_Msk                  (_UINT32_(0x3) << ATSENSE_CTRL_28_2B_OSR_Pos)         /* (ATSENSE_CTRL_28_2B) Over Sampling Ratio Mask */
#define ATSENSE_CTRL_28_2B_OSR(value)               (ATSENSE_CTRL_28_2B_OSR_Msk & (_UINT32_(value) << ATSENSE_CTRL_28_2B_OSR_Pos))
#define   ATSENSE_CTRL_28_2B_OSR8_Val                 _UINT32_(0x0)                   /* (ATSENSE_CTRL_28_2B) System OSR = 8  */
#define   ATSENSE_CTRL_24_27_OSR16_Val                _UINT32_(0x1)                   /* (ATSENSE_CTRL_28_2B) System OSR = 16 */
#define   ATSENSE_CTRL_24_27_OSR32_Val                _UINT32_(0x2)                   /* (ATSENSE_CTRL_28_2B) System OSR = 32 */
#define   ATSENSE_CTRL_24_27_OSR64_Val                _UINT32_(0x3)                   /* (ATSENSE_CTRL_28_2B) System OSR = 64 */
#define ATSENSE_CTRL_28_2B_MSB_MODE_Pos             _UINT32_(4)                                 /* (ATSENSE_CTRL_28_2B) Mode Selection Position */
#define ATSENSE_CTRL_28_2B_MSB_MODE_Msk             (_UINT32_(0x1) << ATSENSE_CTRL_28_2B_MSB_MODE_Pos)         /* (ATSENSE_CTRL_28_2B) Mode Selection Mask */
#define ATSENSE_CTRL_28_2B_MSB_MODE(value)          (ATSENSE_CTRL_28_2B_MSB_MODE_Msk & (_UINT32_(value) << ATSENSE_CTRL_28_2B_MSB_MODE_Pos))
#define   ATSENSE_CTRL_28_2B_MSB_MODE_32BITS_Val      _UINT32_(0x0)                   /* (ATSENSE_CTRL_28_2B) 32-bits mode  */
#define   ATSENSE_CTRL_28_2B_MSB_MODE_16BITS_Val      _UINT32_(0x1)                   /* (ATSENSE_CTRL_28_2B) 16-bits mode */

/* -------- POWER_OFFSET_P_A : (MET_CONTROL Offset: 0xDC) (R/W  32) Phase-A active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_A) Phase-A active power offset Position */
#define POWER_OFFSET_P_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_A_Pos)      /* (POWER_OFFSET_P_A) Phase-A active power offset Mask */
#define POWER_OFFSET_P_A(value)                     (POWER_OFFSET_P_A_Msk & (_UINT32_(value) << POWER_OFFSET_P_A_Pos))

/* -------- POWER_OFFSET_P_B : (MET_CONTROL Offset: 0xE0) (R/W  32) Phase-B active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_B_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_B) Phase-B active power offset Position */
#define POWER_OFFSET_P_B_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_B_Pos)      /* (POWER_OFFSET_P_B) Phase-B active power offset Mask */
#define POWER_OFFSET_P_B(value)                     (POWER_OFFSET_P_B_Msk & (_UINT32_(value) << POWER_OFFSET_P_B_Pos))

/* -------- POWER_OFFSET_P_C : (MET_CONTROL Offset: 0xE4) (R/W  32) Phase-C active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_C_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_C) Phase-C active power offset Position */
#define POWER_OFFSET_P_C_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_C_Pos)      /* (POWER_OFFSET_P_C) Phase-C active power offset Mask */
#define POWER_OFFSET_P_C(value)                     (POWER_OFFSET_P_C_Msk & (_UINT32_(value) << POWER_OFFSET_P_C_Pos))

/* -------- POWER_OFFSET_Q_A : (MET_CONTROL Offset: 0xDC) (R/W  32) Phase-A reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Position */
#define POWER_OFFSET_Q_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_A_Pos)      /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Mask */
#define POWER_OFFSET_Q_A(value)                     (POWER_OFFSET_Q_A_Msk & (_UINT32_(value) << POWER_OFFSET_Q_A_Pos))

/* -------- POWER_OFFSET_Q_B : (MET_CONTROL Offset: 0xE0) (R/W  32) Phase-B reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_B_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_B) Phase-B reactive power offset Position */
#define POWER_OFFSET_Q_B_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_B_Pos)      /* (POWER_OFFSET_Q_B) Phase-B reactive power offset Mask */
#define POWER_OFFSET_Q_B(value)                     (POWER_OFFSET_Q_B_Msk & (_UINT32_(value) << POWER_OFFSET_Q_B_Pos))

/* -------- POWER_OFFSET_Q_C : (MET_CONTROL Offset: 0xE4) (R/W  32) Phase-C reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_C_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_C) Phase-C reactive power offset Position */
#define POWER_OFFSET_Q_C_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_C_Pos)      /* (POWER_OFFSET_Q_C) Phase-C reactive power offset Mask */
#define POWER_OFFSET_Q_C(value)                     (POWER_OFFSET_Q_C_Msk & (_UINT32_(value) << POWER_OFFSET_Q_C_Pos))

/* -------- VERSION : (MET_STATUS Offset: 0x00) (R/W  32) Metrology Version -------- */
#define VERSION_FIRMWARE_REV_Pos                    _UINT32_(0)                                 /* (VERSION) Firmware Revision Position */
#define VERSION_FIRMWARE_REV_Msk                    (_UINT32_(0xFF) << VERSION_FIRMWARE_REV_Pos)      /* (VERSION) Firmware Revision Mask */
#define VERSION_FIRMWARE_REV(value)                 (VERSION_FIRMWARE_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_REV_Pos))
#define VERSION_FIRMWARE_MINOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Minor Firmware Revision Position */
#define VERSION_FIRMWARE_MINOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MINOR_REV_Pos)      /* (VERSION) Minor Firmware Revision Mask */
#define VERSION_FIRMWARE_MINOR_REV(value)           (VERSION_FIRMWARE_MINOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MINOR_REV_Pos))
#define VERSION_FIRMWARE_MAJOR_REV_Pos              _UINT32_(8)                                 /* (VERSION) Major  Firmware Revision Position */
#define VERSION_FIRMWARE_MAJOR_REV_Msk              (_UINT32_(0xFF) << VERSION_FIRMWARE_MAJOR_REV_Pos)      /* (VERSION) Major  Firmware Revision Mask */
#define VERSION_FIRMWARE_MAJOR_REV(value)           (VERSION_FIRMWARE_MAJOR_REV_Msk & (_UINT32_(value) << VERSION_FIRMWARE_MAJOR_REV_Pos))

/* -------- STATUS : (MET_STATUS Offset: 0x04) (R/W  32) Metrology status -------- */
#define STATUS_STATUS_Pos                           _UINT32_(0)                       /* (STATUS) Metrology status Position */
#define STATUS_STATUS_Msk                           (_UINT32_(0x0F) << STATUS_STATUS_Pos)      /* (STATUS) Metrology status Mask */
#define STATUS_STATUS(value)                        (STATUS_STATUS_Msk & (_UINT32_(value) << STATUS_STATUS_Pos))
#define   STATUS_STATUS_HALT					      _UINT32_(0x0)                   /* (STATUS) Metrology module is halted */
#define   STATUS_STATUS_RESET					      _UINT32_(0x1)                   /* (STATUS) Resetting metrology module */ 
#define   STATUS_STATUS_INIT_DSP			          _UINT32_(0x2)                   /* (STATUS) Initializing DSP filters */
#define   STATUS_STATUS_DSP_READY			          _UINT32_(0x3)                   /* (STATUS) DSP filters have been initialized */
#define   STATUS_STATUS_INIT_ATSENSE	              _UINT32_(0x4)                   /* (STATUS) Initializing ATSENSE */
#define   STATUS_STATUS_ATSENSE_READY	              _UINT32_(0x5)                   /* (STATUS) ATSENSE has been initialized */
#define   STATUS_STATUS_READY					      _UINT32_(0x6)                   /* (STATUS) ATSENSE temperature configuration & calibration data has been copied into output registers */
#define   STATUS_STATUS_DSP_SETTLING	              _UINT32_(0x7)                   /* (STATUS) Waiting for DSP filters to stabilize to full accuracy */
#define   STATUS_STATUS_DSP_RUNNING		              _UINT32_(0x8)                   /* (STATUS) DSP filters have stabilized to full accuracy */

