Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- STATUS : (MET_STATUS Offset: 0x08) (R/W  32) Metrology state flags -------- */
#define STATUS_STATE_FLAG_PH_A_ACTIVE_Pos           _UINT32_(0)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_A_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_A_ACTIVE_Pos)      /* (STATUS) Phase A active Mask */
#define STATUS_STATE_FLAG_PH_A_ACTIVE(value)        (STATUS_STATE_FLAG_PH_A_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_A_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_A_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase A is inactive  */
#define   STATUS_STATE_FLAG_PH_A_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase A is active */
#define STATUS_STATE_FLAG_PH_B_ACTIVE_Pos           _UINT32_(1)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_B_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_B_ACTIVE_Pos)      /* (STATUS) Phase B active Mask */
#define STATUS_STATE_FLAG_PH_B_ACTIVE(value)        (STATUS_STATE_FLAG_PH_B_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_B_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_B_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase B is inactive  */
#define   STATUS_STATE_FLAG_PH_B_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase B is active */
#define STATUS_STATE_FLAG_PH_C_ACTIVE_Pos           _UINT32_(2)                       /* (STATUS) Phase A active Position */
#define STATUS_STATE_FLAG_PH_C_ACTIVE_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_PH_C_ACTIVE_Pos)      /* (STATUS) Phase C active Mask */
#define STATUS_STATE_FLAG_PH_C_ACTIVE(value)        (STATUS_STATE_FLAG_PH_C_ACTIVE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PH_C_ACTIVE_Pos))
#define   STATUS_STATE_FLAG_PH_C_ACTIVE_INACTIVE_Val  _UINT32_(0x0)                   /* (STATUS) Voltage phase C is inactive  */
#define   STATUS_STATE_FLAG_PH_C_ACTIVE_ACTIVE_Val    _UINT32_(0x1)                   /* (STATUS) Voltage phase C is active */
#define STATUS_STATE_FLAG_TIMING_Vx_Pos             _UINT32_(3)                       /* (STATUS) Active Voltage Channel Position */
#define STATUS_STATE_FLAG_TIMING_Vx_Msk             (_UINT32_(0x03) << STATUS_STATE_FLAG_TIMING_Vx_Pos)      /* (STATUS) Active Voltage Channel Mask */
#define STATUS_STATE_FLAG_TIMING_Vx(value)          (STATUS_STATE_FLAG_TIMING_Vx_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_TIMING_Vx_Pos))
#define   STATUS_STATE_FLAG_TIMING_Vx_A_Val           _UINT32_(0x0)                   /* (STATUS) Voltage phase VA is used for timing extraction purposes  */
#define   STATUS_STATE_FLAG_TIMING_Vx_B_Val           _UINT32_(0x1)                   /* (STATUS) Voltage phase VB is used for timing extraction purposes */
#define   STATUS_STATE_FLAG_TIMING_Vx_C_Val           _UINT32_(0x2)                   /* (STATUS) Voltage phase VC is used for timing extraction purposes */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Pos           _UINT32_(5)                       /* (STATUS) Frequency Locked Flag Position */
#define STATUS_STATE_FLAG_FREQ_LOCKED_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos)      /* (STATUS) Frequency Locked Flag Mask */
#define STATUS_STATE_FLAG_FREQ_LOCKED(value)        (STATUS_STATE_FLAG_FREQ_LOCKED_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_FREQ_LOCKED_Pos))
#define   STATUS_STATE_FLAG_FREQ_LOCKED_DISABLED_Val   _UINT32_(0x0)                   /* (STATUS) Line frequency is not determined  */
#define   STATUS_STATE_FLAG_FREQ_LOCKED_ENABLED_Val    _UINT32_(0x1)                   /* (STATUS) Line frequency has been determined */
#define STATUS_STATE_FLAG_ATSENSE_FAIL_Pos           _UINT32_(7)                       /* (STATUS) ATSENSE state Position */
#define STATUS_STATE_FLAG_ATSENSE_FAIL_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_ATSENSE_FAIL_Pos)      /* (STATUS) ATSENSE state Mask */
#define STATUS_STATE_FLAG_ATSENSE_FAIL(value)        (STATUS_STATE_FLAG_ATSENSE_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_ATSENSE_FAIL_Pos))
#define   STATUS_STATE_FLAG_ATSENSE_FAIL_DISABLED_Val   _UINT32_(0x0)                   /* (STATUS) ATSENSE initialization is successful  */
#define   STATUS_STATE_FLAG_ATSENSE_FAIL_ENABLED_Val    _UINT32_(0x1)                   /* (STATUS) ATSENSE initialization is failed */
#define STATUS_STATE_FLAG_HARMONIC_m_CONF_Pos        _UINT32_(8)                       /* (STATUS) Harmonic Analysis Result Indication Position */
#define STATUS_STATE_FLAG_HARMONIC_m_CONF_Msk        (_UINT32_(0x7F) << STATUS_STATE_FLAG_HARMONIC_m_CONF_Pos)      /* (STATUS) Harmonic Analysis Result Indication Mask */
#define STATUS_STATE_FLAG_HARMONIC_m_CONF(value)     (STATUS_STATE_FLAG_HARMONIC_m_CONF_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_HARMONIC_m_CONF_Pos))
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Pos           _UINT32_(15)                       /* (STATUS) Host Identification Failure Indication Position */
#define STATUS_STATE_FLAG_HOST_ID_FAIL_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos)      /* (STATUS) Host Identification Failure Indication Mask */
#define STATUS_STATE_FLAG_HOST_ID_FAIL(value)        (STATUS_STATE_FLAG_HOST_ID_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_HOST_ID_FAIL_Pos))
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_SUCCESS_Val   _UINT32_(0x0)                   /* (STATUS) Proper PIC32CXMTx part successfully identified  */
#define   STATUS_STATE_FLAG_HOST_ID_FAIL_FAIL_Val      _UINT32_(0x1)                   /* (STATUS) Failed to identify proper PIC32CXMTx part */
#define STATUS_STATE_FLAG_CREEP_DET_IA_Pos           _UINT32_(16)                       /* (STATUS) Phase A Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IA_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IA_Pos)      /* (STATUS) Phase A Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IA(value)        (STATUS_STATE_FLAG_CREEP_DET_IA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IA_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IA_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel A current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IA_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel A current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_IB_Pos           _UINT32_(17)                       /* (STATUS) Phase B Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IB_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IB_Pos)      /* (STATUS) Phase B Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IB(value)        (STATUS_STATE_FLAG_CREEP_DET_IB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IB_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IB_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel B current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IB_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel B current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_IC_Pos           _UINT32_(18)                       /* (STATUS) Phase C Current Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_IC_Msk           (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_IC_Pos)      /* (STATUS) Phase C Current Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_IC(value)        (STATUS_STATE_FLAG_CREEP_DET_IC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_IC_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_IC_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Channel C current creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_IC_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Channel C current creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Pos            _UINT32_(19)                       /* (STATUS) Total Reactive Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_Q_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos)      /* (STATUS) Total Reactive Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_Q(value)         (STATUS_STATE_FLAG_CREEP_DET_Q_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_Q_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_Q_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Reactive power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_Q_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Reactive power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_CREEP_DET_P_Pos            _UINT32_(20)                       /* (STATUS) Total Active Power Creep Detected Flag Position */
#define STATUS_STATE_FLAG_CREEP_DET_P_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_CREEP_DET_P_Pos)      /* (STATUS) Total Active Power Creep Detected Flag Mask */
#define STATUS_STATE_FLAG_CREEP_DET_P(value)         (STATUS_STATE_FLAG_CREEP_DET_P_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_CREEP_DET_P_Pos))
#define   STATUS_STATE_FLAG_CREEP_DET_P_NO_DETECT_Val   _UINT32_(0x0)                   /* (STATUS) Active power creep isn?t detected in the current full line cycle  */
#define   STATUS_STATE_FLAG_CREEP_DET_P_DETECT_Val      _UINT32_(0x1)                   /* (STATUS) Active power creep is detected in the current full line cycle */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos            _UINT32_(21)                       /* (STATUS) Architecture Detect Failure Position */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos)      /* (STATUS) Architecture Detect Failure Mask */
#define STATUS_STATE_FLAG_ARCH_DETECT_FAIL(value)         (STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_ARCH_DETECT_FAIL_Pos))
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_NO_FAIL_Val     _UINT32_(0x0)                   /* (STATUS) A proper device (?SH? or ?C?) was detected  */
#define   STATUS_STATE_FLAG_ARCH_DETECT_FAIL_FAIL_Val        _UINT32_(0x1)                   /* (STATUS) An improper device (not ?SH? nor ?C?) was detected */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos            _UINT32_(22)                       /* (STATUS) Phase Corrector Out of Range Position */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk            (_UINT32_(0x01) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos)      /* (STATUS) Phase Corrector Out of Range Mask */
#define STATUS_STATE_FLAG_PC_OUT_OF_RANGE(value)         (STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_PC_OUT_OF_RANGE_Pos))
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_IN_Val         _UINT32_(0x0)                   /* (STATUS) Requested phase correction values in range  */
#define   STATUS_STATE_FLAG_PC_OUT_OF_RANGE_OUT_Val        _UINT32_(0x1)                   /* (STATUS) Requested phase correction values out of range */
#define STATUS_STATE_FLAG_SAG_DET_VA_Pos                 _UINT32_(24)                       /* (STATUS) Voltage Sag Detected Flag for Channel A Position */
#define STATUS_STATE_FLAG_SAG_DET_VA_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VA_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel A Mask */
#define STATUS_STATE_FLAG_SAG_DET_VA(value)              (STATUS_STATE_FLAG_SAG_DET_VA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VA_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VA_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SAG_DET_VA_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SAG_DET_VB_Pos                 _UINT32_(25)                       /* (STATUS) Voltage Sag Detected Flag for Channel B Position */
#define STATUS_STATE_FLAG_SAG_DET_VB_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VB_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel B Mask */
#define STATUS_STATE_FLAG_SAG_DET_VB(value)              (STATUS_STATE_FLAG_SAG_DET_VB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VB_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VB_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SAG_DET_VB_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SAG_DET_VC_Pos                 _UINT32_(26)                       /* (STATUS) Voltage Sag Detected Flag for Channel C Position */
#define STATUS_STATE_FLAG_SAG_DET_VC_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SAG_DET_VC_Pos)      /* (STATUS) Voltage Sag Detected Flag for Channel C Mask */
#define STATUS_STATE_FLAG_SAG_DET_VC(value)              (STATUS_STATE_FLAG_SAG_DET_VC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SAG_DET_VC_Pos))
#define   STATUS_STATE_FLAG_SAG_DET_VC_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage sag isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SAG_DET_VC_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage sag is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VA_Pos                 _UINT32_(28)                       /* (STATUS) Voltage Swell Detected Flag for Channel A Position */
#define STATUS_STATE_FLAG_SWELL_DET_VA_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VA_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel A Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VA(value)              (STATUS_STATE_FLAG_SWELL_DET_VA_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VA_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VA_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VA_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VB_Pos                 _UINT32_(29)                       /* (STATUS) Voltage Swell Detected Flag for Channel B Position */
#define STATUS_STATE_FLAG_SWELL_DET_VB_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VB_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel B Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VB(value)              (STATUS_STATE_FLAG_SWELL_DET_VB_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VB_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VB_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VB_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */
#define STATUS_STATE_FLAG_SWELL_DET_VC_Pos                 _UINT32_(30)                       /* (STATUS) Voltage Swell Detected Flag for Channel C Position */
#define STATUS_STATE_FLAG_SWELL_DET_VC_Msk                 (_UINT32_(0x01) << STATUS_STATE_FLAG_SWELL_DET_VC_Pos)      /* (STATUS) Voltage Swell Detected Flag for Channel C Mask */
#define STATUS_STATE_FLAG_SWELL_DET_VC(value)              (STATUS_STATE_FLAG_SWELL_DET_VC_Msk & (_UINT32_(value) << STATUS_STATE_FLAG_SWELL_DET_VC_Pos))
#define   STATUS_STATE_FLAG_SWELL_DET_VC_NO_DETECTED_Val     _UINT32_(0x0)                   /* (STATUS) Voltage swell isn?t detected in the current half line cycle  */
#define   STATUS_STATE_FLAG_SWELL_DET_VC_DETECTED_Val        _UINT32_(0x1)                   /* (STATUS) Voltage swell is detected in the current half line cycle */

/* -------- CAPTURE_STATUS : (MET_STATUS Offset: 0x0C) (R/W  32) Waveform Capture Function Status -------- */
#define CAPTURE_STATUS_CAPTURE_OFFSET_Pos                  _UINT32_(0)                       /* (CAPTURE_STATUS) Offset within the buffer Position */
#define CAPTURE_STATUS_CAPTURE_OFFSET_Msk                  (_UINT32_(0xFFFFFF) << CAPTURE_STATUS_CAPTURE_OFFSET_Pos)      /* (CAPTURE_STATUS) Offset within the buffer Mask */
#define CAPTURE_STATUS_CAPTURE_OFFSET(value)               (CAPTURE_STATUS_CAPTURE_OFFSET_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_OFFSET_Pos))
#define CAPTURE_STATUS_CAPTURE_STATE_Pos                   _UINT32_(24)                       /* (CAPTURE_STATUS) Waveform Capture Status Position */
#define CAPTURE_STATUS_CAPTURE_STATE_Msk                   (_UINT32_(0xF) << CAPTURE_STATUS_CAPTURE_STATE_Pos)      /* (CAPTURE_STATUS) Waveform Capture Status Mask */
#define CAPTURE_STATUS_CAPTURE_STATE(value)                (CAPTURE_STATUS_CAPTURE_STATE_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_STATE_Pos))
#define   CAPTURE_STATUS_CAPTURE_STATE_DISABLED_Val          _UINT32_(0x0)                   /* (CAPTURE_STATUS) Disabled  */
#define   CAPTURE_STATUS_CAPTURE_STATE_ACTIVE_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Capture in progress  */
#define   CAPTURE_STATUS_CAPTURE_STATE_COMPLETE_Val          _UINT32_(0x2)                   /* (CAPTURE_STATUS) Capture completed  */
#define CAPTURE_STATUS_INVALID_ADDR_Pos                    _UINT32_(28)                       /* (CAPTURE_STATUS) Invalid Capture Address Position */
#define CAPTURE_STATUS_INVALID_ADDR_Msk                    (_UINT32_(0x1) << CAPTURE_STATUS_INVALID_ADDR_Pos)      /* (CAPTURE_STATUS) Invalid Capture Address Mask */
#define CAPTURE_STATUS_INVALID_ADDR(value)                 (CAPTURE_STATUS_INVALID_ADDR_Msk & (_UINT32_(value) << CAPTURE_STATUS_INVALID_ADDR_Pos))
#define   CAPTURE_STATUS_INVALID_ADDR_WITHIN_Val             _UINT32_(0x0)                   /* (CAPTURE_STATUS) Capture address within valid range   */
#define   CAPTURE_STATUS_INVALID_ADDR_OUTSIDE_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Capture address outside valid range  */
#define CAPTURE_STATUS_CAPTURE_WRAP_Pos                    _UINT32_(31)                       /* (CAPTURE_STATUS) Capture Buffer Wrapped Position */
#define CAPTURE_STATUS_CAPTURE_WRAP_Msk                    (_UINT32_(0x1) << CAPTURE_STATUS_CAPTURE_WRAP_Pos)      /* (STATUS) Capture Buffer Wrapped Mask */
#define CAPTURE_STATUS_CAPTURE_WRAP(value)                 (CAPTURE_STATUS_CAPTURE_WRAP_Msk & (_UINT32_(value) << CAPTURE_STATUS_CAPTURE_WRAP_Pos))
#define   CAPTURE_STATUS_CAPTURE_WRAP_NOT_WRAPPED_Val        _UINT32_(0x0)                   /* (CAPTURE_STATUS) Buffer has not wrapped  */
#define   CAPTURE_STATUS_CAPTURE_WRAP_WRAPPED_Val            _UINT32_(0x1)                   /* (CAPTURE_STATUS) Buffer has wrapped at least once */

