Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/config/pic32cxmtsh_db/driver/metrology/drv_metrology_regs.h
/* -------- ATSENSE_CAL_45_48 : (MET_STATUS Offset: 0x88) (R/W  32) ATSENSE Calibration Trim Data, Registers: 0x45 ? 0x48 -------- */
#define ATSENSE_CAL_45_48_REF_TH_11_8_Pos                   _UINT32_(0) 
#define ATSENSE_CAL_45_48_REF_TH_11_8_Msk                   (_UINT32_(0xF) << ATSENSE_CAL_45_48_REF_TH_11_8_Pos) 
#define ATSENSE_CAL_45_48_REF_TH_11_8(value)                (ATSENSE_CAL_45_48_REF_TH_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_REF_TH_11_8_Pos))
#define ATSENSE_CAL_45_48_REF_TH_0_7_Pos                    _UINT32_(8) 
#define ATSENSE_CAL_45_48_REF_TH_0_7_Msk                    (_UINT32_(0xFF) << ATSENSE_CAL_45_48_REF_TH_0_7_Pos) 
#define ATSENSE_CAL_45_48_REF_TH_0_7(value)                 (ATSENSE_CAL_45_48_REF_TH_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_REF_TH_0_7_Pos))
#define ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos                  _UINT32_(16) 
#define ATSENSE_CAL_45_48_TEMP_TH_11_8_Msk                  (_UINT32_(0xF) << ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos) 
#define ATSENSE_CAL_45_48_TEMP_TH_11_8(value)               (ATSENSE_CAL_45_48_TEMP_TH_11_8_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_TEMP_TH_11_8_Pos))
#define ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos                   _UINT32_(24) 
#define ATSENSE_CAL_45_48_TEMP_TH_0_7_Msk                   (_UINT32_(0xFF) << ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos) 
#define ATSENSE_CAL_45_48_TEMP_TH_0_7(value)                (ATSENSE_CAL_45_48_TEMP_TH_0_7_Msk & (_UINT32_(value) << ATSENSE_CAL_45_48_TEMP_TH_0_7_Pos))


/** \brief Metrology Harmonic Analysis Output register API structure */
typedef struct
{
    __I  uint32_t I_A_m_R;            /**< Offset: 0x00 (R/  32) The real part of DFT result for current, phase-A, m-th harmonics (sQ25.6) */           
    __I  uint32_t V_A_m_R;            /**< Offset: 0x04 (R/  32) The real part of DFT result for voltage, phase-A, m-th harmonics (sQ25.6) */           
    __I  uint32_t I_B_m_R;            /**< Offset: 0x08 (R/  32) The real part of DFT result for current, phase-B, m-th harmonics (sQ25.6) */     
    __I  uint32_t V_B_m_R;            /**< Offset: 0x0C (R/  32) The real part of DFT result for voltage, phase-B, m-th harmonics (sQ25.6) */         
    __I  uint32_t I_C_m_R;            /**< Offset: 0x10 (R/  32) The real part of DFT result for current, phase-C, m-th harmonics (sQ25.6) */
    __I  uint32_t V_C_m_R;            /**< Offset: 0x14 (R/  32) The real part of DFT result for voltage, phase-C, m-th harmonics (sQ25.6) */
    __I  uint32_t I_A_m_I;            /**< Offset: 0x18 (R/  32) The imaginary part of DFT result for current, phase-A, m-th harmonics (sQ25.6) */
    __I  uint32_t V_A_m_I;            /**< Offset: 0x1C (R/  32) The imaginary part of DFT result for voltage, phase-A, m-th harmonics (sQ25.6) */
    __I  uint32_t I_B_m_I;            /**< Offset: 0x20 (R/  32) The imaginary part of DFT result for current, phase-B, m-th harmonics (sQ25.6) */
    __I  uint32_t V_B_m_I;            /**< Offset: 0x24 (R/  32) The imaginary part of DFT result for voltage, phase-B, m-th harmonics (sQ25.6) */
    __I  uint32_t I_C_m_I;            /**< Offset: 0x28 (R/  32) The imaginary part of DFT result for current, phase-C, m-th harmonics (sQ25.6) */
    __I  uint32_t V_C_m_I;            /**< Offset: 0x2C (R/  32) The imaginary part of DFT result for voltage, phase-C, m-th harmonics (sQ25.6) */
    __I  uint32_t Reserved1[3];   
} MET_HARMONICS;

/** \brief Metrology Accumulated Output register API structure */
typedef struct
{
    __I  uint64_t I_A;               /**< Offset: 0x08  (R/  32) Amp-squared-samples, phase-A, fundamental + harmonics (uQ24.40) */  
    __I  uint64_t I_B;               /**< Offset: 0x10  (R/  32) Amp-squared-samples, phase-B, fundamental + harmonics (uQ24.40) */
    __I  uint64_t I_C;               /**< Offset: 0x18  (R/  32) Amp-squared-samples, phase-C, fundamental + harmonics (uQ24.40) */
    __I  uint64_t I_Ni;              /**< Offset: 0x20  (R/  32) Amp-squared-samples, phase-N inputed, fundamental + harmonics (uQ44.20) */  
    __I  uint64_t I_Nm;              /**< Offset: 0x28  (R/  32) Amp-squared-samples, phase-N measured, fundamental + harmonics (uQ44.20) */  
    __I  uint64_t I_A_F;             /**< Offset: 0x30  (R/  32) Amp-squared-samples, phase-A, fundamental only (uQ24.40) */  
    __I  uint64_t I_B_F;             /**< Offset: 0x38  (R/  32) Amp-squared-samples, phase-B, fundamental only (uQ24.40) */
    __I  uint64_t I_C_F;             /**< Offset: 0x40  (R/  32) Amp-squared-samples, phase-C, fundamental only (uQ24.40) */
    __I  uint64_t I_Nmi;             /**< Offset: 0x48  (R/  32) Amp-squared-samples, phase-N, fundamental only (uQ44.20) */  
    __I  uint64_t Reserved1[6];                          
    __I  int64_t  P_A;               /**< Offset: 0x78  (R/  32) Watt-samples, phase-A, fundamental + harmonics (sQ23.40) */   
    __I  int64_t  P_B;               /**< Offset: 0x80  (R/  32) Watt-samples, phase-B, fundamental + harmonics (sQ23.40) */
    __I  int64_t  P_C;               /**< Offset: 0x88  (R/  32) Watt-samples, phase-C, fundamental + harmonics (sQ23.40) */
    __I  int64_t  P_A_F;             /**< Offset: 0x90  (R/  32) Watt-samples, phase-A, fundamental only (sQ23.40) */ 
    __I  int64_t  P_B_F;             /**< Offset: 0x98  (R/  32) Watt-samples, phase-B, fundamental only (sQ23.40) */ 
    __I  int64_t  P_C_F;             /**< Offset: 0xA0  (R/  32) Watt-samples, phase-C, fundamental only (sQ23.40) */  
    __I  int64_t  P_N;               /**< Offset: 0xA8  (R/  32) Watt-samples, phase-N, fundamental only (sQ23.40) */  
    __I  int64_t  P_N_F;             /**< Offset: 0xB0  (R/  32) Watt-samples, phase-N, fundamental only (sQ23.40) */ 
    __I  uint64_t Reserved2;                        
    __I  int64_t  Q_A;               /**< Offset: 0xC0  (R/  32) VAR-samples, phase-A, fundamental + harmonics (sQ23.40) */         
    __I  int64_t  Q_B;               /**< Offset: 0xC8  (R/  32) VAR-samples, phase-B, fundamental + harmonics (sQ23.40) */         
    __I  int64_t  Q_C;               /**< Offset: 0xD0  (R/  32) VAR-samples, phase-C, fundamental + harmonics (sQ23.40) */
    __I  int64_t  Q_A_F;             /**< Offset: 0xD8  (R/  32) VAR-samples, phase-A, fundamental only (sQ23.40) */ 
    __I  int64_t  Q_B_F;             /**< Offset: 0xE0  (R/  32) VAR-samples, phase-B, fundamental only (sQ23.40) */ 
    __I  int64_t  Q_C_F;             /**< Offset: 0xE8  (R/  32) VAR-samples, phase-C, fundamental only (sQ23.40) */ 
    __I  int64_t  Q_N;               /**< Offset: 0xF0  (R/  32) VAR-samples, phase-N, fundamental only (sQ23.40) */ 
    __I  int64_t  Q_N_F;             /**< Offset: 0xF8  (R/  32) VAR-samples, phase-N, fundamental only (sQ23.40) */ 
    __I  uint64_t Reserved3;
    __I  uint64_t V_A;               /**< Offset: 0x108 (R/  32) Volt-square-samples, phase-A, fundamental + harmonics (sQ24.40) */ 
    __I  uint64_t V_B;               /**< Offset: 0x110 (R/  32) Volt-square-samples, phase-B, fundamental + harmonics (sQ24.40) */ 
    __I  uint64_t V_C;               /**< Offset: 0x118 (R/  32) Volt-square-samples, phase-C, fundamental + harmonics (sQ24.40) */
    __I  uint64_t Reserved4;
    __I  uint64_t V_A_F;             /**< Offset: 0x128 (R/  32) Volt-square-samples, phase-A, fundamental only (uQ24.40) */
    __I  uint64_t V_B_F;             /**< Offset: 0x130 (R/  32) Volt-square-samples, phase-B, fundamental only (uQ24.40 */
    __I  uint64_t V_C_F;             /**< Offset: 0x138 (R/  32) Volt-square-samples, phase-C, fundamental only (uQ24.40 */
    __I  uint64_t Reserved5;
    __I  uint64_t V_AB;              /**< Offset: 0x148 (R/  32) Volt-square-samples, VA - VB, fundamental + harmonics (uQ24.40 */
    __I  uint64_t V_BC;              /**< Offset: 0x150 (R/  32) Volt-square-samples, VB - VC, fundamental + harmonics (uQ24.40 */
    __I  uint64_t V_CA;              /**< Offset: 0x158 (R/  32) Volt-square-samples, VC - VA, fundamental + harmonics (uQ24.40 */
    __I  uint64_t V_AB_F;            /**< Offset: 0x160 (R/  32) Volt-square-samples, VA - VB, fundamental only (uQ24.40 */
    __I  uint64_t V_BC_F;            /**< Offset: 0x168 (R/  32) Volt-square-samples, VB - VC, fundamental only (uQ24.40 */
    __I  uint64_t V_CA_F;            /**< Offset: 0x170 (R/  32) Volt-square-samples, VC - VA, fundamental only (uQ24.40 */
    __I  uint64_t Reserved6[3];
    __I  int64_t  ACC_T0;            /**< Offset: 0x190 (R/  32) Total accumulated quantities specified by PC0_TYPE (sQ33.30) */
    __I  int64_t  ACC_T1;            /**< Offset: 0x198 (R/  32) Total accumulated quantities specified by PC1_TYPE (sQ33.30) */
    __I  int64_t  ACC_T2;            /**< Offset: 0x1A0 (R/  32) Total accumulated quantities specified by PC2_TYPE (sQ33.30) */
    __I  uint64_t Reserved7[2];  
} MET_ACCUMULATORS;

/** \brief Metrology Status register API structure */
typedef struct
{
    __I  uint32_t VERSION;                 /**< Offset: 0x00 (R/  32) Metrology firmware version */           
    __I  uint32_t STATUS;                  /**< Offset: 0x04 (R/  32) Metrology status register */           
    __I  uint32_t STATE_FLAG;              /**< Offset: 0x08 (R/  32) Metrology state flags register */           
    __I  uint32_t CAPTURE_STATUS;          /**< Offset: 0x0C (R/  32) Waveform Capture Function Status */           
    __I  uint32_t INTERVAL_NUM;            /**< Offset: 0x10 (R/  32) Interval number */           
    __I  uint32_t N;                       /**< Offset: 0x14 (R/  32) Number of Samples in the Last Measurement Interval (uQ16.0) */           
    __I  uint32_t PH_OFFSET;               /**< Offset: 0x18 (R/  32) Phase Correction Filter Offset (sQ0.31) */           
    __I  uint32_t FREQ;                    /**< Offset: 0x1C (R/  32) Active Line Voltage Fundamental Harmonic Frequency (uQ20.12) */           
    __I  uint32_t FREQ_VA;                 /**< Offset: 0x20 (R/  32) Frequency of fundamental harmonic, VA (uQ20.12) */           
    __I  uint32_t FREQ_VB;                 /**< Offset: 0x24 (R/  32) Frequency of fundamental harmonic, VB (uQ20.12) */           
    __I  uint32_t FREQ_VC;                 /**< Offset: 0x28 (R/  32) Frequency of fundamental harmonic, VC (uQ20.12) */           
    __I  uint32_t Reserved1;  
    __I  uint32_t TEMPERATURE;             /**< Offset: 0x30 (R/  32) Sensor Temperature (sQ23.8) */           
    __I  uint32_t I_A_MAX;                 /**< Offset: 0x34 (R/  32) Phase A Current Peak (sQ2.29) */           
    __I  uint32_t I_B_MAX;                 /**< Offset: 0x38 (R/  32) Phase B Current Peak (sQ2.29) */           
    __I  uint32_t I_C_MAX;                 /**< Offset: 0x3C (R/  32) Phase C Current Peak (sQ2.29) */           
    __I  uint32_t I_Ni_MAX;                /**< Offset: 0x40 (R/  32) Neutral Current Peak (sQ16.15) */           
    __I  uint32_t I_Nm_MAX;                /**< Offset: 0x44 (R/  32) Neutral Current Peak (sQ16.15) */   
    __I  uint32_t V_A_MAX;                 /**< Offset: 0x48 (R/  32) Max phase-A measured current during measurement interval (sQ2.29)*/           
    __I  uint32_t V_B_MAX;                 /**< Offset: 0x4C (R/  32) Max phase-B measured current during measurement interval (sQ2.29)*/           
    __I  uint32_t V_C_MAX;                 /**< Offset: 0x50 (R/  32) Max phase-C measured current during measurement interval (sQ2.29)*/           
    __I  uint32_t FEATURES;                /**< Offset: 0x54 (R/  32) Compiled feature indicator */           
    __I  uint32_t Reserved2[8];  
    __I  uint32_t ZC_N_VA;                 /**< Offset: 0x78 (R/  32) Zero-crossing sample number of phase-A voltage (uQ20.12) */           
    __I  uint32_t ZC_N_VB;                 /**< Offset: 0x7C (R/  32) Zero-crossing sample number of phase-B voltage (uQ20.12) */           
    __I  uint32_t ZC_N_VC;                 /**< Offset: 0x80 (R/  32) Zero-crossing sample number of phase-C voltage (uQ20.12) */           
    __I  uint32_t ATSENSE_CAL_41_44;       /**< Offset: 0x84 (R/  32) ATSENSE Calibration Trim Data, Registers: 0x41 ? 0x44 */           
    __I  uint32_t ATSENSE_CAL_45_48;       /**< Offset: 0x88 (R/  32) ATSENSE Calibration Trim Data, Registers: 0x45 ? 0x48 */           
} MET_STATUS;

/** \brief Metrology Control register API structure */
typedef struct
{
   __IO  uint32_t STATE_CTRL;              /**< Offset: 0x00 (R/W  32) Metrology state control register */
   __IO  uint32_t FEATURE_CTRL0;           /**< Offset: 0x04 (R/W  32) Metrology feature setting register 0 */
   __IO  uint32_t FEATURE_CTRL1;           /**< Offset: 0x08 (R/W  32) Metrology feature setting register 1 */
   __IO  uint32_t METER_TYPE;              /**< Offset: 0x0C (R/W  32) Sensor type and service type settings register */
   __IO  uint32_t M;                       /**< Offset: 0x10 (R/W  32) Number of line cycles for integration period (uQ12.0) */
   __IO  uint32_t N_MAX;                   /**< Offset: 0x14 (R/W  32) Maximum number of samples in an integration period (uQ24.0) */
   __IO  uint32_t PULSE0_CTRL;             /**< Offset: 0x18 (R/W  32) Pulse 0 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE1_CTRL;             /**< Offset: 0x1C (R/W  32) Pulse 1 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t PULSE2_CTRL;             /**< Offset: 0x20 (R/W  32) Pulse 2 control: enable/disable, polarity, quantity type selection */
   __IO  uint32_t P_K_t;                   /**< Offset: 0x24 (R/W  32) Meter Active Power Pulse Constant (uQ8.24) */
   __IO  uint32_t Q_K_t;                   /**< Offset: 0x28 (R/W  32) Meter Reactive Power Pulse Constant (uQ8.24) */
   __IO  uint32_t I_K_t;                   /**< Offset: 0x2C (R/W  32) Meter Current Pulse Constant (uQ8.24) */
   __IO  uint32_t CREEP_THRESHOLD_P;       /**< Offset: 0x30 (R/W  32) Creep Threshold for Active Energy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_Q;       /**< Offset: 0x34 (R/W  32) Creep Threshold for Quadergy (uQ2.30) */
   __IO  uint32_t CREEP_THRESHOLD_I;       /**< Offset: 0x38 (R/W  32) Creep Threshold of Phase Current (uQ2.30) */
   __IO  uint32_t POWER_OFFSET_CTRL;       /**< Offset: 0x3C (R/W  32) Power offset control */
   __IO  uint32_t POWER_OFFSET_P;          /**< Offset: 0x40 (R/W  32) Active Power Offset (sQ1.30) */
   __IO  uint32_t POWER_OFFSET_Q;          /**< Offset: 0x44 (R/W  32) Reactive Power Offset (sQ1.30) */
   __IO  uint32_t SWELL_THRESHOLD_VA;      /**< Offset: 0x48 (R/W  32) Voltage swell threshold for each half cycle of phase-A voltage (uQ0.32) */
   __IO  uint32_t SWELL_THRESHOLD_VB;      /**< Offset: 0x4C (R/W  32) Voltage swell threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t SWELL_THRESHOLD_VC;      /**< Offset: 0x50 (R/W  32) Voltage swell threshold for each half cycle of phase-C voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VA;        /**< Offset: 0x54 (R/W  32) Voltage sag threshold for each half cycle of phase-A voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VB;        /**< Offset: 0x58 (R/W  32) Voltage sag threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t SAG_THRESHOLD_VC;        /**< Offset: 0x5C (R/W  32) Voltage sag threshold for each half cycle of phase-B voltage (uQ0.32) */
   __IO  uint32_t K_IA;                    /**< Offset: 0x60 (R/W  32) ADC input current conversion factor = I_A(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VA;                    /**< Offset: 0x64 (R/W  32) ADC input voltage conversion factor = V_A(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IB;                    /**< Offset: 0x68 (R/W  32) ADC input current conversion factor = I_B(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VB;                    /**< Offset: 0x6C (R/W  32) ADC input voltage conversion factor = V_B(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IC;                    /**< Offset: 0x70 (R/W  32) ADC input current conversion factor = I_C(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_VC;                    /**< Offset: 0x74 (R/W  32) ADC input voltage conversion factor = V_C(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t K_IN;                    /**< Offset: 0x78 (R/W  32) ADC input current conversion factor = I_N(rms)/Vadc(rms) (uQ22.10) */
   __IO  uint32_t CAL_M_IA;                /**< Offset: 0x7C (R/W  32) Current magnitude calibration constant, I_A  (sQ2.29) */
   __IO  uint32_t CAL_M_VA;                /**< Offset: 0x80 (R/W  32) Voltage magnitude calibration constant, V_A  (sQ2.29) */
   __IO  uint32_t CAL_M_IB;                /**< Offset: 0x84 (R/W  32) Current magnitude calibration constant, I_B  (sQ2.29) */
   __IO  uint32_t CAL_M_VB;                /**< Offset: 0x88 (R/W  32) Voltage magnitude calibration constant, V_B  (sQ2.29) */
   __IO  uint32_t CAL_M_IC;                /**< Offset: 0x8C (R/W  32) Current magnitude calibration constant, I_C  (sQ2.29) */
   __IO  uint32_t CAL_M_VC;                /**< Offset: 0x90 (R/W  32) Voltage magnitude calibration constant, V_C  (sQ2.29) */
   __IO  uint32_t CAL_M_IN;                /**< Offset: 0x94 (R/W  32) Current magnitude calibration constant, I_N  (sQ2.29) */
   __IO  uint32_t CAL_PH_IA;               /**< Offset: 0x98 (R/W  32) Current phase calibration constant, I_A (sQ0.31) */
   __IO  uint32_t CAL_PH_VA;               /**< Offset: 0x9C (R/W  32) Voltage phase calibration constant, V_A (sQ0.31) */
   __IO  uint32_t CAL_PH_IB;               /**< Offset: 0xA0 (R/W  32) Current phase calibration constant, I_B (sQ0.31) */
   __IO  uint32_t CAL_PH_VB;               /**< Offset: 0xA4 (R/W  32) Voltage phase calibration constant, V_B (sQ0.31) */
   __IO  uint32_t CAL_PH_IC;               /**< Offset: 0xA8 (R/W  32) Current phase calibration constant, I_C (sQ0.31) */
   __IO  uint32_t CAL_PH_VC;               /**< Offset: 0xAC (R/W  32) Voltage phase calibration constant, V_C (sQ0.31) */
   __IO  uint32_t CAL_PH_IN;               /**< Offset: 0xB0 (R/W  32) Current phase calibration constant, I_N (sQ0.31) */
   __IO  uint32_t CAPTURE_CTRL;            /**< Offset: 0xB4 (R/W  32) Waveform capture control register */
   __IO  uint32_t CAPTURE_BUFF_SIZE;       /**< Offset: 0xB8 (R/W  32) Waveform capture buffer size in units of 32-bits */
   __IO  uint32_t CAPTURE_ADDR;            /**< Offset: 0xBC (R/W  32) Waveform capture buffer address pointer */
   __IO  uint32_t Reserved1;
   __IO  uint32_t Reserved2;
   __IO  uint32_t Reserved3;
   __IO  uint32_t ATSENSE_CTRL_20_23;      /**< Offset: 0xCC (R/W  32) ATSense control: channels I0,I1,V1,I2 */
   __IO  uint32_t ATSENSE_CTRL_24_27;      /**< Offset: 0xD0 (R/W  32) ATSense control: channels V2,I3,V3,ANA */
   __IO  uint32_t ATSENSE_CTRL_28_2B;      /**< Offset: 0xD4 (R/W  32) ATSense control: Registers: x28, x2A-2B, x2D */
   __IO  uint32_t Reserved4;
   __IO  uint32_t POWER_OFFSET_P_A;        /**< Offset: 0xDC (R/W  32) Phase-A active power offset (sQ9.40) */
   __IO  uint32_t POWER_OFFSET_P_B;        /**< Offset: 0xE0 (R/W  32) Phase-B active power offset (sQ9.40) */
   __IO  uint32_t POWER_OFFSET_P_C;        /**< Offset: 0xE4 (R/W  32) Phase-C active power offset (sQ9.40) */
   __IO  uint32_t POWER_OFFSET_Q_A;        /**< Offset: 0xE8 (R/W  32) Phase-A reactive power offset (sQ9.40) */
   __IO  uint32_t POWER_OFFSET_Q_B;        /**< Offset: 0xEC (R/W  32) Phase-B reactive power offset (sQ9.40) */
   __IO  uint32_t POWER_OFFSET_Q_C;        /**< Offset: 0xF0 (R/W  32) Phase-C reactive power offset (sQ9.40) */
} MET_CONTROL;

/** \brief METROLOGY register API structure */
typedef struct
{
    MET_CONTROL       MET_CONTROL;         /**< Offset: 0x0000 (R/W  32) Metrology Control Registers */
    MET_STATUS        MET_STATUS;          /**< Offset: 0x00F4 (R/   32) Metrology Status Registers */
    MET_ACCUMULATORS  MET_ACCUMULATORS;    /**< Offset: 0x0180 (R/   32) Metrology Accumulated Output Registers */
    MET_HARMONICS     MET_HARMONICS;       /**< Offset: 0x0338 (R/   32) Metrology Harmonic Analysis Output Registers */
} MET_REGISTERS;



#endif /* _METROLOGY_REGS_H_ */
